Repository: rffontenelle/devguide-pt-br
Catalog: advanced-tools/clang.po
Languages: pt_br

source: Dynamic Analysis with Clang
pt_br: Análise dinâmica com Clang

source: This document describes how to use Clang to perform analysis on Python and its libraries. In addition to performing the analysis, the document will cover downloading, building and installing the latest Clang/LLVM combination (which is currently 3.4).
pt_br: Este documento descreve como usar o Clang para realizar análises em Python e suas bibliotecas. Além de realizar a análise, o documento abordará o download, a criação e a instalação da combinação Clang/LLVM mais recente (que atualmente é 3.4).

source: This document does not cover interpreting the findings. For a discussion of interpreting results, see Marshall Clow's `Testing libc++ with -fsanitize=undefined <https://cplusplusmusings.wordpress.com/tag/clang/>`_. The blog posting is a detailed examinations of issues uncovered by Clang in ``libc++``.
pt_br: Este documento não abrange a interpretação dos resultados. Para uma discussão sobre a interpretação dos resultados, consulte `Testing libc++ with -fsanitize=undefined <https://cplusplusmusings.wordpress.com/tag/clang/>`_ de Marshall Clow. A postagem do blog é um exame detalhado dos problemas descobertos pelo Clang em ``libc++``.

source: What is Clang?
pt_br: O que é Clang?

source: Clang is the C, C++ and Objective C front-end for the LLVM compiler. The front-end provides access to LLVM's optimizer and code generator. The sanitizers - or checkers - are hooks into the code generation phase to instrument compiled code so suspicious behavior is flagged.
pt_br: Clang é o front-end de C, C++ e Objective C para o compilador LLVM. O front-end fornece acesso ao otimizador e gerador de código do LLVM. Os sanitizadores - ou verificadores - são ganchos na fase de geração de código para instrumentar o código compilado, de modo que o comportamento suspeito seja sinalizado.

source: What are Sanitizers?
pt_br: O que são sanitizadores?

source: Clang sanitizers are runtime checkers used to identify suspicious and undefined behavior. The checking occurs at runtime with actual runtime parameters so false positives are kept to a minimum.
pt_br: Sanitizadores Clang são verificadores de tempo de execução usados para identificar comportamentos suspeitos e indefinidos. A verificação ocorre no tempo de execução com os parâmetros de tempo de execução reais, de modo que os falsos positivos sejam reduzidos ao mínimo.

source: There are a number of sanitizers available, but two that should be used on a regular basis are the Address Sanitizer (or ASan) and the Undefined Behavior Sanitizer (or UBSan). ASan is invoked with the compiler option ``-fsanitize=address``, and UBSan is invoked with ``-fsanitize=undefined``. The flags are passed through ``CFLAGS`` and ``CXXFLAGS``, and sometimes through ``CC`` and ``CXX`` (in addition to the compiler).
pt_br: Há vários sanitizadores disponíveis, mas dois que devem ser usados regularmente são o Address Sanitizer (ou ASan) e o Undefined Behavior Sanitizer (ou UBSan). Em português, o ASan seria sanitizador de endereço e UBSan seria sanitizador de comportador indefinido. ASan é invocado com a opção do compilador ``-fsanitize=address``, e UBSan é invocado com ``-fsanitize=undefined``. Os sinalizadores, ou *flags*, são passados através de ``CFLAGS`` e ``CXXFLAGS``, e algumas vezes através de ``CC`` e ``CXX`` (além do compilador).

source: A complete list of sanitizers can be found at `Controlling Code Generation <https://clang.llvm.org/docs/UsersManual.html#controlling-code-generation>`_.
pt_br: Uma lista completa de sanitizadores pode ser encontrada em `Controlling Code Generation <https://clang.llvm.org/docs/UsersManual.html#controlling-code-generation>`_.

source: Because sanitizers operate at runtime on real program parameters, its important to provide a complete set of positive and negative self tests.
pt_br: Como os sanitizadores operam em tempo de execução em parâmetros reais do programa, é importante fornecer um conjunto completo de autotestes positivos e negativos.

source: Clang and its sanitizers have strengths (and weaknesses). Its just one tool in the war chest to uncovering bugs and improving code quality. Clang should be used to compliment other methods, including Code Reviews, Valgrind, Coverity, etc.
pt_br: Clang e seus sanitizadores têm pontos fortes (e fracos). É apenas uma ferramenta no baú de guerra para descobrir bugs e melhorar a qualidade do código. O Clang deve ser usado para complementar outros métodos, incluindo Code Reviews, Valgrind, Coverity, etc.

source: Clang/LLVM Setup
pt_br: Instalação de Clang/LLVM

source: This portion of the document covers downloading, building and installing Clang and LLVM. There are three components to download and build. They are the LLVM compiler, the compiler front end and the compiler runtime library.
pt_br: Esta parte do documento abrange o download, a criação e a instalação do Clang e do LLVM. Existem três componentes para baixar e compilar. Eles são o compilador LLVM, o front-end do compilador e a biblioteca de tempo de execução do compilador.

source: In preparation you should create a scratch directory. Also ensure you are using Python 2 and not Python 3. Python 3 will cause the build to fail.
pt_br: Em preparação, você deve criar um diretório temporário. Além disso, verifique se você está usando o Python 2 e não o Python 3. O Python 3 fará com que a compilação falhe.

source: Download, Build and Install
pt_br: Baixar, compilar e instalar

source: Perform the following to download, build and install the Clang/LLVM 3.4. ::
pt_br: Execute o seguinte para baixar, compilar e instalar o Clang/LLVM 3.4. ::

source: If you receive an error ``'LibraryDependencies.inc' file not found``, then ensure you are utilizing Python 2 and not Python 3. If you encounter the error after switching to Python 2, then delete everything and start over.
pt_br: Se você receber um erro ``'LibraryDependencies.inc' file not found``, certifique-se de estar utilizando o Python 2 e não o Python 3. Se você encontrar o erro após mudar para o Python 2, exclua tudo e comece de novo.

source: After ``make install`` executes, the compilers will be installed in ``/usr/local/bin`` and the various libraries will be installed in ``/usr/local/lib/clang/3.4/lib/linux/``:
pt_br: Após a execução do ``make install``, os compiladores serão instalados em ``/usr/local/bin`` e as várias bibliotecas serão instaladas em ``/usr/local/lib/clang/3.4/lib/linux/``:

source: On macOS, the libraries are installed in ``/usr/local/lib/clang/3.3/lib/darwin/``:
pt_br: No macOS, as bibliotecas são instaladas em ``/usr/local/lib/clang/3.3/lib/darwin/``:

source: You should never have to add the libraries to a project. Clang will handle it for you. If you find you cannot pass the ``-fsanitize=XXX`` flag through ``make``'s implicit variables (``CFLAGS``, ``CXXFLAGS``, ``CC``, ``CXXFLAGS``, ``LDFLAGS``) during ``configure``, then you should modify the makefile after configuring to ensure the flag is passed through the compiler.
pt_br: Você nunca deve ter que adicionar as bibliotecas a um projeto. Clang cuidará disso para você. Se você achar que não pode passar o sinalizador ``-fsanitize=XXX`` através das variáveis implícitas do ``make`` (``CFLAGS``, ``CXXFLAGS``, ``CC``, ``CXXFLAGS`` , ``LDFLAGS``) durante o ``configure``, então você deve modificar o makefile após a configuração para garantir que o sinalizador seja passado pelo compilador.

source: The installer does not install all the components needed on occasion. For example, you might want to run a ``scan-build`` or examine the results with ``scan-view``. You can copy the components by hand with: ::
pt_br: O instalador ocasionalmente não instala todos os componentes necessários. Por exemplo, você pode querer executar um ``scan-build`` ou examinar os resultados com ``scan-view``. Você pode copiar os componentes manualmente com: ::

source: Because the installer does not install all the components needed on occasion, you should not delete the scratch directory until you are sure things work as expected. If a library is missing, then you should search for it in the Clang/LLVM build directory.
pt_br: Como o instalador não instala todos os componentes necessários ocasionalmente, você não deve excluir o diretório temporário até ter certeza de que tudo está funcionando conforme o esperado. Se uma biblioteca estiver faltando, você deve procurá-la no diretório de compilação Clang/LLVM.

source: Python Build Setup
pt_br: Configuração da compilação do Python

source: This portion of the document covers invoking Clang and LLVM with the options required so the sanitizers analyze Python with under its test suite. Two checkers are used - ASan and UBSan.
pt_br: Esta parte do documento aborda a invocação do Clang e do LLVM com as opções necessárias para que os sanitizadores analisem o Python em seu conjunto de testes. Dois verificadores são usados - ASan e UBSan.

source: Because the sanitizers are runtime checkers, its best to have as many positive and negative self tests as possible. You can never have enough self tests.
pt_br: Como os sanitizadores são verificadores de tempo de execução, é melhor ter tantos autotestes positivos e negativos quanto possível. Você nunca pode ter autotestes suficientes.

source: The general idea is to compile and link with the sanitizer flags. At link time, Clang will include the needed runtime libraries. However, you can't use ``CFLAGS`` and ``CXXFLAGS`` to pass the options through the compiler to the linker because the makefile rules for ``BUILDPYTHON``, ``_testembed`` and ``_freeze_importlib`` don't use the implicit variables.
pt_br: A ideia geral é compilar e vincular com os sinalizadores do sanitizador. No momento de vinculação ou *link*, o Clang incluirá as bibliotecas de tempo de execução necessárias. No entanto, você não pode usar ``CFLAGS`` e ``CXXFLAGS`` para passar as opções através do compilador para o vinculador, ou *linker*, porque as regras do makefile para ``BUILDPYTHON``, ``_testembed`` e ``_freeze_importlib`` não use as variáveis implícitas.

source: As a workaround to the absence of flags to the linker, you can pass the sanitizer options by way of the compilers - ``CC`` and ``CXX``. Passing the flags though the compiler is used below, but passing them through ``LDFLAGS`` is also reported to work.
pt_br: Como solução para a ausência de sinalizadores para o vinculador, você pode passar as opções do higienizador por meio dos compiladores - ``CC`` e ``CXX``. Passar os sinalizadores pelo compilador é usado abaixo, mas passá-los através do ``LDFLAGS`` também funciona.

source: Building Python
pt_br: Compilando o Python

source: To begin, export the variables of interest with the desired sanitizers. Its OK to specify both sanitizers: ::
pt_br: Para começar, exporte as variáveis de interesse com os sanitizadores desejados. Não há problema em especificar os dois sanitizadores: ::

source: Or: ::
pt_br: Ou: ::

source: The ``-fno-sanitize=vptr`` removes vtable checks that are part of UBSan from C++ projects due to noise. Its not needed with Python, but you will likely need it for other C++ projects.
pt_br: O ``-fno-sanitize=vptr`` remove verificações a vtable que fazem parte do UBSan de projetos C++ devido ao ruído. Não é necessário com o Python, mas você provavelmente precisará dele para outros projetos C++.

source: After exporting ``CC`` and ``CXX``, ``configure`` as normal:
pt_br: Após exportar ``CC`` e ``CXX``, execute o ``configure`` normalmente:

source: Next is a standard ``make`` (formatting added for clarity):
pt_br: O próximo é um ``make`` padrão (formatação adicionada para maior clareza):

source: Finally is ``make test`` (formatting added for clarity):
pt_br: Por fim, temos ``make test`` (formatação adicionada para maior clareza):

source: If you are using the address sanitizer, its important to pipe the output through ``asan_symbolize.py`` to get a good trace. For example, from Issue 20953 during compile (formatting added for clarity):
pt_br: Se você estiver usando o sanitizador de endereços, é importante canalizar a saída através de ``asan_symbolize.py`` para obter um bom rastreamento ou *trace*. Por exemplo, da edição 20953 durante a compilação (formatação adicionada para maior clareza):

source: ``asan_symbolize.py`` is supposed to be installed during ``make install``. If its not installed, then look in the Clang/LLVM build directory for it and copy it to ``/usr/local/bin``.
pt_br: ``asan_symbolize.py`` deve ser instalado durante o ``make install``. Se não estiver instalado, procure-o no diretório de compilação do Clang/LLVM e copie-o para ``/usr/local/bin``.

source: Blacklisting (Ignoring) Findings
pt_br: Bloqueando (ignorando) descobertas

source: Clang allows you to alter the behavior of sanitizer tools for certain source-level by providing a special blacklist file at compile-time. The blacklist is needed because it reports every instance of an issue, even if the issue is reported 10's of thousands of time in un-managed library code.
pt_br: O Clang permite que você altere o comportamento das ferramentas do sanitizador para determinado nível de origem, fornecendo um arquivo de lista negra especial em tempo de compilação. A lista de bloqueio é necessária porque relata todas as instâncias de um problema, mesmo que o problema seja relatado dezenas de milhares de vezes em código de biblioteca não gerenciado.

source: You specify the blacklist with ``-fsanitize-blacklist=XXX``. For example::
pt_br: Você especifica a lista de bloqueio com ``-fsanitize-blacklist=XXX``. Por exemplo::

source: ``my_blacklist.txt`` would then contain entries such as the following. The entry will ignore a bug in ``libc++``'s ``ios`` formatting functions::
pt_br: ``my_blacklist.txt`` conteria entradas como as seguintes. A entrada irá ignorar um bug nas funções de formatação ``ios`` do ``libc++``::

source: As an example with Python 3.4.0, ``audioop.c`` will produce a number of findings::
pt_br: Como um exemplo com Python 3.4.0, ``audioop.c`` produzirá uma série de descobertas::

source: One of the function of interest is ``audioop_getsample_impl`` (flagged at line 422), and the blacklist entry would include::
pt_br: Uma das funções de interesse é ``audioop_getsample_impl`` (sinalizada na linha 422), e a entrada da lista negra incluiria::

source: Or, you could ignore the entire file with::
pt_br: Ou você pode ignorar o arquivo inteiro com::

source: Unfortunately, you won't know what to blacklist until you run the sanitizer.
pt_br: Infelizmente, você não saberá o que colocar na lista de bloqueio até executar o sanitizador.

source: The documentation is available at `Sanitizer special case list <https://clang.llvm.org/docs/SanitizerSpecialCaseList.html>`_.
pt_br: A documentação está disponível em `Lista de casos especiais do sanitizador <https://clang.llvm.org/docs/SanitizerSpecialCaseList.html>`_.
