Repository: rffontenelle/devguide-pt-br
Catalog: advanced-tools/coverity.po
Languages: pt_br

source: Coverity Scan is a free service for static code analysis of Open Source projects. It is based on Coverity's commercial product and is able to analyze C, C++ and Java code.
pt_br: Coverity Scan (em português, varredura de cobertura) é um serviço gratuito para análise de código estático de projetos de código aberto. Ele é baseado no produto comercial da Coverity e é capaz de analisar códigos C, C++ e Java.

source: Coverity's static code analysis doesn't run the code. Instead of that it uses abstract interpretation to gain information about the code's control flow and data flow. It's able to follow all possible code paths that a program may take. For example the analyzer understands that ``malloc()`` returns a memory that must be freed with ``free()`` later. It follows all branches and function calls to see if all possible combinations free the memory. The analyzer is able to detect all sorts of issues like resource leaks (memory, file descriptors), NULL dereferencing, use after free, unchecked return values, dead code, buffer overflows, integer overflows, uninitialized variables, and many more.
pt_br: A análise de código estático do Coverity não executa o código. Em vez disso, ele usa interpretação abstrata para obter informações sobre o fluxo de controle e o fluxo de dados do código. É capaz de seguir todos os caminhos de código possíveis que um programa pode seguir. Por exemplo, o analisador entende que ``malloc()`` retorna uma memória que deve ser liberada com ``free()`` posteriormente. Ele segue todos os ramos e chamadas de função para ver se todas as combinações possíveis liberam a memória. O analisador é capaz de detectar todos os tipos de problemas, como vazamentos de recursos (memória, descritores de arquivo), desreferenciação de NULL, uso após liberação, valores de retorno não verificados, código morto, estouros de buffer, estouros de número inteiro, variáveis não inicializadas e muito mais.

source: Access to analysis reports
pt_br: Acesso a relatórios de análise

source: The results are available on the `Coverity Scan`_ website. In order to access the results you have to create an account yourself. Then go to *Projects using Scan* and add yourself to the Python project. New members must be approved by an admin (see `Contact`_).
pt_br: Os resultados estão disponíveis no site do `Coverity Scan`_. Para acessar os resultados, você mesmo deve criar uma conta. Em seguida, vá para *Projects using Scan* e adicione-se ao projeto Python. Novos membros devem ser aprovados por um administrador (consulte `Contact`_).

source: Access is restricted to Python core developers only. Other individuals may be given access at our own discretion, too. Every now and then Coverity detects a critical issue in Python's code -- new analyzers may even find new bugs in mature code. We don't want to disclose issues prematurely.
pt_br: O acesso é restrito apenas aos desenvolvedores principais do Python. Outros indivíduos também podem ter acesso a nosso próprio critério. De vez em quando, o Coverity detecta um problema crítico no código do Python - novos analisadores podem até encontrar novos bugs no código maduro. Não queremos divulgar questões prematuramente.

source: Building and uploading analysis
pt_br: Compilando e enviando análises

source: The process is automated. A script checks out the code, runs ``cov-build`` and uploads the latest analysis to Coverity. Since Coverity has limited the maximum number of builds per week Python is analyzed every second day. The build runs on a dedicated virtual machine on PSF's infrastructure at OSU Open Source Labs. The process is maintained by Christian Heimes (see `Contact`_). At present only the tip is analyzed with the 64bit Linux tools.
pt_br: O processo é automatizado. Um script verifica o código, executa ``cov-build`` e envia a análise mais recente para o Coverity. Como o Coverity limitou o número máximo de compilações por semana, o Python é analisado a cada dois dias. A compilação é executada em uma máquina virtual dedicada na infraestrutura do PSF no OSU Open Source Labs. O processo é mantido por Christian Heimes (ver `Contact`_). No momento, apenas a dica é analisada com as ferramentas do Linux de 64 bits.

source: Known limitations
pt_br: Limitações conhecidas

source: Some aspects of Python's C code are not yet understood by Coverity.
pt_br: Alguns aspectos do código C do Python ainda não são compreendidos pelo Coverity.

source: False positives
pt_br: Falsos-positivos

source: Coverity doesn't understand that ``N`` format char passes the object along without touching its reference count. On this ground the analyzer detects a resource leak. CID 719685
pt_br: O Coverity não entende que o caractere de formato ``N`` passa o objeto sem tocar em sua contagem de referência. Com base nisso, o analisador detecta um vazamento de recursos. CID 719685

source: ``PyLong_FromLong()`` for negative values
pt_br: ``PyLong_FromLong()`` para valores negativos

source: Coverity claims that ``PyLong_FromLong()`` and other ``PyLong_From*()`` functions cannot handle a negative value because the value might be used as an array index in ``get_small_int()``. CID 486783
pt_br: Coverity afirma que ``PyLong_FromLong()`` e outras funções ``PyLong_From*()`` não podem lidar com um valor negativo porque o valor pode ser usado como um índice de array em ``get_small_int()``. CID 486783

source: ``PyLong_FromLong()`` for n in [-5 ... +255]
pt_br: ``PyLong_FromLong()`` para n em [-5 ... +255]

source: For integers in the range of Python's small int cache the ``PyLong_From*()`` function can never fail and never returns NULL. CID 1058291
pt_br: Para inteiros no intervalo de cache com small int do Python, a função ``PyLong_From*()`` pode nunca falhar e nunca retorna NULL. CID 1058291

source: Some functions use the format char combination such as ``s#``, ``u#`` or ``z#`` to get data and length of a character array. Coverity doesn't recognize the relation between data and length. Sometimes it detects a buffer overflow if data is written to a fixed size buffer although ``length <= sizeof(buffer)``. CID 486613
pt_br: Algumas funções usam a combinação de caracteres de formato como ``s#``, ``u#`` ou ``z#`` para obter dados e comprimento de um array de caracteres. Coverity não reconhece a relação entre dados e comprimento. Às vezes, ele detecta um estouro de buffer se os dados forem gravados em um buffer de tamanho fixo, embora ``lenght <= sizeof(buffer)``. CID 486613

source: ``path_converter()`` dereferencing after null check
pt_br: ``path_converter()`` ser desreferenciado após verificação de null

source: The ``path_converter()`` function in ``posixmodule.c`` makes sure that either ``path_t.narrow`` or ``path_t.wide`` is filled unless ``path_t.nullable`` is explicitly enabled. CID 719648
pt_br: A função ``path_converter()`` em ``posixmodule.c`` garante que ``path_t.narrow`` ou ``path_t.wide`` seja preenchido, a menos que ``path_t.nullable`` esteja explicitamente ativado. CID 719648

source: Modeling
pt_br: Modelagem

source: Modeling is explained in the *Coverity Help Center* which is available in the help menu of `Coverity Connect`_. `coverity_model.c`_ contains a copy of Python's modeling file for Coverity. Please keep the copy in sync with the model file in *Analysis Settings* of `Coverity Scan`_.
pt_br: A modelagem (em inglês, modeling) é explicada no *Coverity Help Center* que está disponível no menu de ajuda do `Coverity Connect`_. `coverity_model.c`_ contém uma cópia do arquivo de modelagem Python para Coverity. Por favor, mantenha a cópia sincronizada com o arquivo de modelo em *Analysis Settings* de `Coverity Scan`_.

source: Workflow
pt_br: Fluxo de trabalho

source: False positive and intentional issues
pt_br: Falsos positivos e problemas intencionais

source: If the problem is listed under `Known limitations`_ then please set the classification to either "False positive" or "Intentional", the action to "Ignore", owner to your own account and add a comment why the issue is considered false positive or intentional.
pt_br: Se o problema estiver listado em `Limitações conhecidas`_, defina a classificação como "Falso positivo" ou "Intencional", a ação como "Ignorar", proprietário da sua própria conta e adicione um comentário sobre o motivo pelo qual o problema é considerado falso positivo ou intencional.

source: If you think it's a new false positive or intentional then please contact an admin. The first step should be an updated to Python's `Modeling`_ file.
pt_br: Se você acha que é um novo falso positivo ou intencional, entre em contato com um administrador. A primeira etapa deve ser uma atualização para o arquivo de `modelagem`_ do Python.

source: Positive issues
pt_br: Questões positivas

source: You should always create an issue unless it's really a trivial case. Please add the full url to the ticket under *Ext. Reference* and add the CID (Coverity ID) to both the ticket and the checkin message. It makes it much easier to understand the relation between tickets, fixes and Coverity issues.
pt_br: Você deve sempre criar um problema, a menos que seja realmente um caso trivial. Por favor, adicione o URL completo ao ticket em *Ext. Reference* e adicione o CID (Coverity ID) tanto no ticket quanto na mensagem de check-in. Fica muito mais fácil entender a relação entre tickets, correções e problemas de Coverity.

source: Contact
pt_br: Contato

source: Please include both Brett and Christian in any mail regarding Coverity. Mails to Coverity should go through Brett or Christian, too.
pt_br: Por favor, inclua Brett e Christian em qualquer correspondência sobre Coverity. As correspondências para a Coverity também devem passar por Brett ou Christian.

source: admin, maintainer of build machine, intermediary between Python and Coverity
pt_br: administrador, mantenedor da máquina de compilação, intermediário entre Python e Coverity

source: co-admin
pt_br: co-administrador

source: Technical Manager - Coverity Scan
pt_br: Gerente Técnico - Coverity Scan

source: `Coverity Scan FAQ <https://scan.coverity.com/faq/>`_
pt_br: `FAQ do Coverity Scan <https://scan.coverity.com/faq/>`_
