Repository: rffontenelle/devguide-pt-br
Catalog: advanced-tools/gdb.po
Languages: pt_br

source: GDB support
pt_br: Suporte ao GDB

source: If you experience low-level problems such as crashes or deadlocks (e.g. when tinkering with parts of CPython which are written in C), it can be convenient to use a low-level debugger such as gdb in order to diagnose and fix the issue. By default, however, gdb (or any of its front-ends) doesn't know about high-level information specific to the CPython interpreter, such as which Python function is currently executing, or what type or value has a given Python object represented by a standard ``PyObject *`` pointer. We hereafter present two ways to overcome this limitation.
pt_br: Se você tiver problemas de baixo nível, como travamentos ou *deadlocks* (por exemplo, ao mexer em partes do CPython escritas em C), pode ser conveniente usar um depurador de baixo nível, como o gdb, para diagnosticar e corrigir o problema. Por padrão, no entanto, o gdb (ou qualquer um de seus front-ends) não conhece informações de alto nível específicas do interpretador CPython, como qual função Python está sendo executada no momento ou qual tipo ou valor tem um determinado objeto Python representado por um ponteiro ``PyObject *`` padrão. Apresentamos a seguir duas maneiras de superar essa limitação.

source: GDB 7 and later
pt_br: GDB 7 e posterior

source: To activate support, you must add the directory containing ``python-gdb.py`` to GDB's "auto-load-safe-path". Put this in your ``~/.gdbinit`` file::
pt_br: Para ativar o suporte, você deve adicionar o diretório contendo ``python-gdb.py`` ao "auto-load-safe-path" do GDB. Coloque isso no seu arquivo ``~/.gdbinit``::

source: You can also add multiple paths, separated by ``:``.
pt_br: Você também pode adicionar vários caminhos, separados por ``:``.

source: This is what a backtrace looks like (truncated) when this extension is enabled::
pt_br: É assim que um backtrace se parece (truncado) quando esta extensão está habilitada::

source: (Notice how the dictionary argument to ``PyDict_GetItemString`` is displayed as its ``repr()``, rather than an opaque ``PyObject *`` pointer.)
pt_br: (Observe como o argumento do dicionário para ``PyDict_GetItemString`` é exibido como seu ``repr()``, em vez de um ponteiro ``PyObject *`` opaco.)

source: The extension works by supplying a custom printing routine for values of type ``PyObject *``. If you need to access lower-level details of an object, then cast the value to a pointer of the appropriate type. For example::
pt_br: A extensão funciona fornecendo uma rotina de impressão personalizada para valores do tipo ``PyObject *``. Se você precisar acessar detalhes de nível inferior de um objeto, converta o valor em um ponteiro do tipo apropriado. Por exemplo::

source: The pretty-printers try to closely match the ``repr()`` implementation of the underlying implementation of Python, and thus vary somewhat between Python 2 and Python 3.
pt_br: Os *pretty-printters* tentam corresponder de perto à implementação ``repr()`` da implementação subjacente do Python e, portanto, variam um pouco entre o Python 2 e o Python 3.

source: An area that can be confusing is that the custom printer for some types look a lot like gdb's built-in printer for standard types. For example, the pretty-printer for a Python 3 ``int`` gives a ``repr()`` that is not distinguishable from a printing of a regular machine-level integer::
pt_br: Uma área que pode ser confusa é que a impressora personalizada para alguns tipos se parece muito com a impressora integrada do gdb para tipos padrão. Por exemplo, o *pretty-printer* para Python 3 ``int`` dá um ``repr()`` que não é distinguível de uma impressão de um inteiro regular no nível da máquina::

source: A similar confusion can arise with the ``str`` type, where the output looks a lot like gdb's built-in printer for ``char *``::
pt_br: Uma confusão semelhante pode surgir com o tipo ``str``, onde a saída se parece muito com a impressora interna do gdb para ``char *``::

source: The pretty-printer for ``str`` instances defaults to using single-quotes (as does Python's ``repr`` for strings) whereas the standard printer for ``char *`` values uses double-quotes and contains a hexadecimal address::
pt_br: O *pretty-printer* para instâncias ``str`` assume como padrão o uso de aspas simples (assim como o ``repr`` do Python para strings), enquanto o *printer* padrão para valores ``char *`` usa aspas duplas e contém um endereço hexadecimal ::

source: Here's how to see the implementation details of a ``str`` instance (for Python 3, where a ``str`` is a ``PyUnicodeObject *``)::
pt_br: Veja como ver os detalhes de implementação de uma instância ``str`` (para Python 3, onde um ``str`` é um ``PyUnicodeObject *``)::

source: As well as adding pretty-printing support for ``PyObject *``, the extension adds a number of commands to gdb:
pt_br: Além de adicionar suporte a *pretty-print* para ``PyObject *``, a extensão adiciona vários comandos ao gdb:

source: List the Python source code (if any) for the current frame in the selected thread. The current line is marked with a ">"::
pt_br: Lista o código-fonte Python (se houver) para o quadro atual na thread selecionada. A linha atual é marcada com um ">"::

source: Use ``py-list START`` to list at a different line number within the python source, and ``py-list START,END`` to list a specific range of lines within the python source.
pt_br: Use ``py-list START`` para listar em um número de linha diferente dentro da fonte python, e ``py-list START,END`` para listar um intervalo específico de linhas dentro da fonte do python.

source: ``py-up`` and ``py-down``
pt_br: ``py-up`` e ``py-down``

source: The ``py-up`` and ``py-down`` commands are analogous to gdb's regular ``up`` and ``down`` commands, but try to move at the level of CPython frames, rather than C frames.
pt_br: Os comandos ``py-up`` e ``py-down`` são análogos aos comandos regulares ``up`` e ``down`` do gdb, mas tente mover no nível de quadros CPython, em vez de quadros C.

source: gdb is not always able to read the relevant frame information, depending on the optimization level with which CPython was compiled. Internally, the commands look for C frames that are executing ``PyEval_EvalFrameEx`` (which implements the core bytecode interpreter loop within CPython) and look up the value of the related ``PyFrameObject *``.
pt_br: O gdb nem sempre é capaz de ler as informações relevantes do quadro, dependendo do nível de otimização com o qual o CPython foi compilado. Internamente, os comandos procuram quadros C que estão executando ``PyEval_EvalFrameEx`` (que implementa o laço do interpretador de bytecode principal dentro do CPython) e procuram o valor do ``PyFrameObject *`` relacionado.

source: They emit the frame number (at the C level) within the thread.
pt_br: Eles emitem o número do quadro (no nível C) dentro da thread.

source: For example::
pt_br: Por exemplo::

source: so we're at the top of the python stack. Going back down::
pt_br: então estamos no topo da pilha do python. Voltando para baixo::

source: and we're at the bottom of the python stack.
pt_br: e estamos no final da pilha do python.

source: The ``py-bt`` command attempts to display a Python-level backtrace of the current thread.
pt_br: O comando ``py-bt`` tenta exibir um *backtrace* no nível do Python da thread atual.

source: The frame numbers correspond to those displayed by gdb's standard ``backtrace`` command.
pt_br: Os números dos quadros correspondem àqueles exibidos pelo comando ``backtrace`` padrão do gdb.

source: The ``py-print`` command looks up a Python name and tries to print it. It looks in locals within the current thread, then globals, then finally builtins::
pt_br: O comando ``py-print`` procura um nome Python e tenta imprimi-lo. Ele procura locais dentro da thread atual, depois globais e, finalmente, embutidos::

source: The ``py-locals`` command looks up all Python locals within the current Python frame in the selected thread, and prints their representations::
pt_br: O comando ``py-locals`` procura todos os locais do Python dentro do quadro atual do Python na thread selecionada e imprime suas representações::

source: You can of course use other gdb commands. For example, the ``frame`` command takes you directly to a particular frame within the selected thread. We can use it to go a specific frame shown by ``py-bt`` like this::
pt_br: É claro que você pode usar outros comandos gdb. Por exemplo, o comando ``frame`` leva você diretamente a um quadro específico dentro da thread selecionada. Podemos usá-lo para ir a um quadro específico mostrado por ``py-bt`` assim::

source: The ``info threads`` command will give you a list of the threads within the process, and you can use the ``thread`` command to select a different one::
pt_br: O comando ``info threads`` lhe dará uma lista das threads dentro do processo, e você pode usar o comando ``thread`` para selecionar um diferente::

source: You can use ``thread apply all COMMAND`` or (``t a a COMMAND`` for short) to run a command on all threads. You can use this with ``py-bt`` to see what every thread is doing at the Python level::
pt_br: Você pode usar ``thread apply all COMANDO`` ou (``t a a COMANDO`` para abreviar) para executar um comando em todos os threads. Você pode usar isso com ``py-bt`` para ver o que cada thread está fazendo no nível do Python::

source: This is only available for Python 2.7, 3.2 and higher.
pt_br: Isso está disponível apenas para Python 2.7, 3.2 e superior.

source: GDB 6 and earlier
pt_br: GDB 6 ou anterior

source: The file at ``Misc/gdbinit`` contains a gdb configuration file which provides extra commands when working with a CPython process. To register these commands permanently, either copy the commands to your personal gdb configuration file or symlink ``~/.gdbinit`` to ``Misc/gdbinit``. To use these commands from a single gdb session without registering them, type ``source Misc/gdbinit`` from your gdb session.
pt_br: O arquivo em ``Misc/gdbinit`` contém um arquivo de configuração gdb que fornece comandos extras ao trabalhar com um processo CPython. Para registrar esses comandos permanentemente, copie os comandos para seu arquivo de configuração gdb pessoal ou crie um link simbólico ``~/.gdbinit`` para ``Misc/gdbinit``. Para usar esses comandos de uma única sessão gdb sem registrá-los, digite ``source Misc/gdbinit`` de sua sessão gdb.

source: Updating auto-load-safe-path to allow test_gdb to run
pt_br: Atualizando auto-load-safe-path para permitir que test_gdb seja executado

source: ``test_gdb`` attempts to automatically load additional Python specific hooks into gdb in order to test them. Unfortunately, the command line options it uses to do this aren't always supported correctly.
pt_br: ``test_gdb`` tenta carregar automaticamente ganchos adicionais específicos do Python no gdb para testá-los. Infelizmente, as opções de linha de comando que ele usa para fazer isso nem sempre são suportadas corretamente.

source: If ``test_gdb`` is being skipped with an "auto-loading has been declined" message, then it is necessary to identify any Python build directories as auto-load safe. One way to achieve this is to add a line like the following to ``~/.gdbinit`` (edit the specific list of paths as appropriate)::
pt_br: Se ``test_gdb`` estiver sendo ignorado com uma mensagem "auto-loading has been failed", então é necessário identificar quaisquer diretórios de construção do Python como seguros para carregamento automático. Uma maneira de conseguir isso é adicionar uma linha como a seguinte a ``~/.gdbinit`` (edite a lista específica de caminhos conforme apropriado)::

source: GDB tips
pt_br: Dicas de GDB

source: Learning to use GDB effectively improves your chances of successfully debugging problems with Python's internals.
pt_br: Aprender a usar o GDB efetivamente melhora suas chances de depurar com sucesso problemas internos do Python.

source: Saving and loading breakpoints
pt_br: Salvando e carregando pontos de interrupção

source: With extended exposure to particular parts of the Python runtime, you might find it helpful to define a routine set of breakpoints and commands to execute when they are hit. For convenience, save your breakpoints to a file and load them in future sessions using the ``save breakpoints`` command::
pt_br: Com a exposição estendida a partes específicas do tempo de execução do Python, pode ser útil definir um conjunto de rotina de pontos de interrupção e comandos a serem executados quando forem atingidos. Por conveniência, salve seus pontos de interrupção em um arquivo e carregue-os em sessões futuras usando o comando ``save breakpoints``::

source: You can edit the file to your heart's content, then load it in a later session::
pt_br: Você pode editar o arquivo como quiser e carregá-lo em uma sessão posterior::

source: Breaking at labels
pt_br: Interrompendo em rótulos

source: Add commands, save to a file, then reload in future sessions without worrying that the starting line number of individual instructions change over time.
pt_br: Adicione comandos, salve em um arquivo e recarregue em sessões futuras sem se preocupar com a mudança do número da linha inicial de instruções individuais com o tempo.
