Repository: rffontenelle/devguide-pt-br
Catalog: index.po
Languages: pt_br

source: Python Developer's Guide
pt_br: Guia do Desenvolvedor Python

source: This guide is a comprehensive resource for :ref:`contributing <contributing>` to Python_ -- for both new and experienced contributors. It is :ref:`maintained <devguide>` by the same community that maintains Python. We welcome your contributions to Python!
pt_br: Este guia é um recurso abrangente para :ref:`contribuir <contributing>` para o Python_ -- para colaboradores novos e experientes. É :ref:`mantido <devguide>` pela mesma comunidade que mantém o Python. Agradecemos suas contribuições ao Python!

source: Quick Reference
pt_br: Referência rápida

source: Here are the basic steps needed to get set up and contribute a patch. This is meant as a checklist, once you know the basics. For complete instructions please see the :ref:`setup guide <setup>`.
pt_br: Aqui estão as etapas básicas necessárias para configurar e contribuir com um patch. Isso serve como uma lista de verificação, uma vez que você conheça o básico. Para obter instruções completas, consulte o :ref:`guia de configuração <setup>`.

source: Install and set up :ref:`Git <vcsetup>` and other dependencies (see the :ref:`Git Setup <setup>` page for detailed information).
pt_br: Instale e configure :ref:`Git <vcsetup>` e outras dependências (consulte a página :ref:`Configuração do Git <setup>` para obter informações detalhadas).

source: Fork `the CPython repository <https://github.com/python/cpython>`_ to your GitHub account and :ref:`get the source code <checkout>` using::
pt_br: Faça um fork do `repositório CPython <https://github.com/python/cpython>`_ para sua conta GitHub e :ref:`obtenha o código-fonte <checkout>` usando::

source: Build Python, on UNIX and macOS use::
pt_br: Compile Python. No UNIX e macOS use::

source: and on Windows use:
pt_br: e no Windows use::

source: See also :ref:`more detailed instructions <compiling>`, :ref:`how to install and build dependencies <build-dependencies>`, and the platform-specific pages for :ref:`UNIX <unix-compiling>`, :ref:`macOS`, and :ref:`Windows <windows-compiling>`.
pt_br: Veja também :ref:`instruções mais detalhadas <compiling>`, :ref:`como instalar e compilar dependências <build-dependencies>`, e as páginas específicas da plataforma para :ref:`UNIX <unix-compiling>`, :ref:`macOS` e :ref:`Windows <windows-compiling>`.

source: :ref:`Run the tests <runtests>`::
pt_br: :ref:`Execute os testes <runtests>`::

source: On :ref:`most <mac-python.exe>` macOS systems, replace :file:`./python` with :file:`./python.exe`. On Windows, use :file:`python.bat`.
pt_br: Na :ref:`maioria <mac-python.exe>` dos sistemas macOS, substitua :file:`./python` por :file:`./python.exe`. No Windows, use :file:`python.bat`.

source: Create a new branch where your work for the issue will go, e.g.::
pt_br: Crie um novo branch para onde irá o seu trabalho para o problema, por exemplo::

source: If an issue does not already exist, please `create it <https://github.com/python/cpython/issues>`_. Trivial issues (e.g. typo fixes) do not require any issue to be created.
pt_br: Se um relatório de problema ainda não existir, `crie-o <https://github.com/python/cpython/issues>`_. Problemas triviais (por exemplo, correções de erros de digitação) não exigem que um relatório de problema seja criado.

source: Once you fixed the issue, run the tests, run ``make patchcheck``, and if everything is ok, commit.
pt_br: Depois de corrigir o problema, execute os testes, execute ``make patchcheck`` e, se tudo estiver ok, faça o commit.

source: Push the branch on your fork on GitHub and :ref:`create a pull request <pullrequest>`. Include the issue number using ``gh-NNNN`` in the pull request description. For example::
pt_br: Faça o push do branch em seu fork no GitHub e :ref:`crie uma pull request <pullrequest>`. Inclua o número do relatório de problema usando ``gh-NNNN`` na descrição do pull request. Por exemplo::

source: Add a News entry into the ``Misc/NEWS.d`` directory as individual file. The news entry can be created by using `blurb-it <https://blurb-it.herokuapp.com/>`_, or the `blurb <https://pypi.org/project/blurb/>`_ tool and its ``blurb add`` command. Please read more about ``blurb`` in :ref:`documentation <documenting>`.
pt_br: Adicione uma entrada News no diretório ``Misc/NEWS.d`` como arquivo individual. A entrada de notícias pode ser criada usando `blurb-it <https://blurb-it.herokuapp.com/>`_ ou a ferramenta `blurb <https://pypi.org/project/blurb/>`_ e seu comando ``blurb add``. Por favor, leia mais sobre ``blurb`` em :ref:`documentação <documenting>`.

source: First time contributors will need to sign the Contributor Licensing Agreement (CLA) as described in the :ref:`Licensing <cla>` section of this guide.
pt_br: Os contribuidores iniciantes precisarão assinar o Contrato de Licenciamento do Colaborador (CLA) conforme descrito na seção :ref:`Licenciamento <cla>` deste guia.

source: Quick Links
pt_br: Links rápidos

source: Here are some links that you probably will reference frequently while contributing to Python:
pt_br: Aqui estão alguns links que você provavelmente irá referenciar com frequência ao contribuir com o Python:

source: `Issue tracker`_
pt_br: `Rastreador de problemas`_

source: `Buildbot status`_
pt_br: `Status do Buildbot`_

source: Contributing
pt_br: Contribuindo

source: We encourage everyone to contribute to Python and that's why we have put up this developer's guide. If you still have questions after reviewing the material in this guide, then the `Core Python Mentorship`_ group is available to help guide new contributors through the process.
pt_br: Incentivamos todos a contribuir com o Python e é por isso que criamos este guia do desenvolvedor. Se você ainda tiver dúvidas após revisar o material deste guia, o grupo `Core Python Mentorship`_ está disponível para ajudar a guiar novos contribuidores durante o processo.

source: A number of individuals from the Python community have contributed to a series of excellent guides at `Open Source Guides <https://opensource.guide/>`_.
pt_br: Vários indivíduos da comunidade Python contribuíram para uma série de excelentes guias em `Open Source Guides <https://opensource.guide/>`_.

source: Core developers and contributors alike will find the following guides useful:
pt_br: Os desenvolvedores *core* e colaboradores acharão úteis os seguintes guias:

source: `How to Contribute to Open Source <https://opensource.guide/how-to-contribute/>`_
pt_br: `How to Contribute to Open Source <https://opensource.guide/how-to-contribute/>`_ (Como contribuir para o código aberto)

source: `Building Welcoming Communities <https://opensource.guide/building-community/>`_
pt_br: `Building Welcoming Communities <https://opensource.guide/building-community/>`_ (Criando comunidades receptivas)

source: Guide for contributing to Python:
pt_br: Guia para contribuir com o Python:

source: Contributors
pt_br: Contribuidores

source: Documentarians
pt_br: Documentadores

source: Core Developers
pt_br: Desenvolvedores core

source: We **recommend** that the documents in this guide be read as needed. You can stop where you feel comfortable and begin contributing immediately without reading and understanding these documents all at once. If you do choose to skip around within the documentation, be aware that it is written assuming preceding documentation has been read so you may find it necessary to backtrack to fill in missing concepts and terminology.
pt_br: **Recomendamos** que os documentos deste guia sejam lidos conforme necessário. Você pode parar onde se sentir confortável e começar a contribuir imediatamente sem ler e entender esses documentos de uma só vez. Se você optar por pular a documentação, esteja ciente de que ela foi escrita assumindo que a documentação anterior foi lida, portanto, você pode achar necessário retroceder para preencher os conceitos e a terminologia ausentes.

source: Proposing changes to Python itself
pt_br: Propondo mudanças no próprio Python

source: Improving Python's code, documentation and tests are ongoing tasks that are never going to be "finished", as Python operates as part of an ever-evolving system of technology. An even more challenging ongoing task than these necessary maintenance activities is finding ways to make Python, in the form of the standard library and the language definition, an even better tool in a developer's toolkit.
pt_br: Melhorar o código, a documentação e os testes do Python são tarefas contínuas que nunca serão "concluídas", pois o Python opera como parte de um sistema de tecnologia em constante evolução. Uma tarefa contínua ainda mais desafiadora do que essas atividades de manutenção necessárias é encontrar maneiras de tornar o Python, na forma de biblioteca padrão e definição de linguagem, uma ferramenta ainda melhor no kit de ferramentas de um desenvolvedor.

source: While these kinds of change are much rarer than those described above, they do happen and that process is also described as part of this guide:
pt_br: Embora esses tipos de mudança sejam muito mais raros do que os descritos acima, eles acontecem e esse processo também é descrito como parte deste guia:

source: Other Interpreter Implementations
pt_br: Outras implementações de interpretador

source: This guide is specifically for contributing to the Python reference interpreter, also known as CPython (while most of the standard library is written in Python, the interpreter core is written in C and integrates most easily with the C and C++ ecosystems).
pt_br: Este guia é especificamente para contribuir com o interpretador de referência do Python, também conhecido como CPython (enquanto a maior parte da biblioteca padrão é escrita em Python, o núcleo do interpretador é escrito em C e se integra mais facilmente com os ecossistemas C e C++).

source: There are other Python implementations, each with a different focus. Like CPython, they always have more things they would like to do than they have developers to work on them. Some major examples that may be of interest are:
pt_br: Existem outras implementações do Python, cada uma com um foco diferente. Como o CPython, eles sempre têm mais coisas que gostariam de fazer do que desenvolvedores para trabalhar nelas. Alguns exemplos importantes que podem ser interessantes são:

source: PyPy_: A Python interpreter focused on high speed (JIT-compiled) operation on major platforms
pt_br: PyPy_: Um interpretador Python focado em operação de alta velocidade (compilado por JIT) nas principais plataformas

source: Jython_: A Python interpreter focused on good integration with the Java Virtual Machine (JVM) environment
pt_br: Jython_: Um interpretador Python focado em boa integração com o ambiente Java Virtual Machine (JVM)

source: IronPython_: A Python interpreter focused on good integration with the Common Language Runtime (CLR) provided by .NET and Mono
pt_br: IronPython_: Um interpretador Python focado em boa integração com o Common Language Runtime (CLR) fornecido por .NET e Mono

source: Stackless_: A Python interpreter focused on providing lightweight microthreads while remaining largely compatible with CPython specific extension modules
pt_br: Stackless_: um interpretador Python focado em fornecer microthreads leves, permanecendo amplamente compatível com módulos de extensão específicos do CPython

source: MicroPython_: A tiny Python interpreter with small subset of the Python standard library that is optimised to run on microcontrollers and in constrained environments.
pt_br: MicroPython_: Um minúsculo interpretador Python com um pequeno subconjunto da biblioteca padrão Python que é otimizado para rodar em microcontroladores e em ambientes restritos.

source: CircuitPython_: A fork of MicroPython designed to simplify experimenting and learning to code on low-cost microcontroller boards.
pt_br: CircuitPython_: Um fork do MicroPython projetado para simplificar a experimentação e o aprendizado da codificação em placas microcontroladoras de baixo custo.

source: Key Resources
pt_br: Principais recursos

source: Coding style guides
pt_br: Guias de estilo de codificação

source: :PEP:`7` (Style Guide for C Code)
pt_br: :PEP:`7` (Guia de estilo para código em C)

source: :PEP:`8` (Style Guide for Python Code)
pt_br: :PEP:`8` (Guia de estilo para código em Python)

source: Source code
pt_br: Código-fonte

source: `Browse online <https://github.com/python/cpython/>`_
pt_br: `Acessar online <https://github.com/python/cpython/>`_

source: `Snapshot of the *main* branch <https://github.com/python/cpython/archive/main.zip>`_
pt_br: `Snapshot do branch *main* <https://github.com/python/cpython/archive/main.zip>`_

source: Additional Resources
pt_br: Recursos adicionais

source: Anyone can clone the sources for this guide. See :ref:`devguide`.
pt_br: Qualquer pessoa pode clonar os arquivos fonte deste guia. Veja :ref:`devguide`.

source: Help with ...
pt_br: Ajudar com ...

source: Tool support
pt_br: Suporte a ferramentas

source: Various tools with configuration files as found in the `Misc directory`_
pt_br: Várias ferramentas com arquivos de configuração encontrados no `diretório Misc`_

source: Information about editors and their configurations can be found in the `wiki <https://wiki.python.org/moin/PythonEditors>`_
pt_br: Informações sobre editores e suas configurações podem ser encontradas na `wiki <https://wiki.python.org/moin/PythonEditors>`_

source: `python.org maintenance`_
pt_br: `Manutenção do python.org`_

source: :ref:`Search this guide <search>`
pt_br: :ref:`Pesquisar neste guia <search>`

source: Code of Conduct
pt_br: Código de conduta

source: Please note that all interactions on `Python Software Foundation <https://www.python.org/psf-landing/>`__-supported infrastructure is `covered <https://www.python.org/psf/records/board/minutes/2014-01-06/#management-of-the-psfs-web-properties>`__ by the `PSF Code of Conduct <https://www.python.org/psf/conduct/>`__, which includes all infrastructure used in the development of Python itself (e.g. mailing lists, issue trackers, GitHub, etc.). In general this means everyone is expected to be open, considerate, and respectful of others no matter what their position is within the project.
pt_br: Observe que todas as interações na infraestrutura suportada pela `Python Software Foundation <https://www.python.org/psf-landing/>`__ estão `cobertas <https://www.python.org/psf/records/board /minutes/2014-01-06/#management-of-the-psfs-web-properties>`__ pelo `Código de Conduta da PSF <https://www.python.org/psf/conduct/>`__, que inclui toda a infraestrutura usada no desenvolvimento do próprio Python (por exemplo, listas de discussão, rastreadores de problemas, GitHub, etc.). Em geral, isso significa que todos devem ser abertos, atenciosos e respeitosos com os outros, independentemente de sua posição dentro do projeto.

source: Status of Python branches
pt_br: Status dos branches do Python

source: Moved to :ref:`versions`
pt_br: Movido para :ref:`versions`

source: Full Table of Contents
pt_br: Índice completo
