Repository: rffontenelle/devguide-pt-br
Catalog: versions.po
Languages: pt_br

source: Status of Python Versions
pt_br: Status das versões do Python

source: The main branch is currently the future Python 3.12, and is the only branch that accepts new features. The latest release for each Python version can be found on the `download page <https://www.python.org/downloads/>`_.
pt_br: O branch principal é atualmente o futuro Python 3.12, e é o único branch que aceita novos recursos. O lançamento mais recente para cada versão do Python pode ser encontrado na `página de download <https://www.python.org/downloads/>`_.

source: Python Release Cycle
pt_br: Ciclo de lançamentos do Python

source: Supported Versions
pt_br: Versões suportadas

source: Dates shown in *italic* are scheduled and can be adjusted.
pt_br: As datas mostradas em *itálico* são agendadas e podem ser ajustadas.

source: Unsupported Versions
pt_br: Versões não suportadas

source: Status Key
pt_br: Chave do status

source: new features, bugfixes, and security fixes are accepted.
pt_br: novos recursos, correções de bugs e corrções de segurança são aceitos.

source: feature fixes, bugfixes, and security fixes are accepted for the upcoming feature release.
pt_br: correções de recursos, correções de bugs, correções de segurança são aceitos para o próximo lançamento de recurso.

source: bugfixes and security fixes are accepted, new binaries are still released. (Also called **maintenance** mode or **stable** release)
pt_br: correções de bugs e correções de segurança são aceitos, novos binários ainda são lançados. (também chamado de modo **maintenance**, ou manutenção, ou lançamento **stable**, ou estável)

source: only security fixes are accepted and no more binaries are released, but new source-only versions can be released
pt_br: apenas correções de segurança são aceitas e não são lançados mais binários, mas novas versões somente de código-fonte podem ser lançadas

source: release cycle is frozen; no further changes can be pushed to it.
pt_br: ciclo de lançamento é congelado; nenhuma alteração adicional pode ser enviada para ela.

source: See also the :ref:`devcycle` page for more information about branches.
pt_br: Veja também a página :ref:`devcycle` para mais informações sobre branches.

source: By default, the end-of-life is scheduled 5 years after the first release, but can be adjusted by the release manager of each branch. All Python 2 versions have reached end-of-life.
pt_br: Por padrão, o fim de vida é programado 5 anos após o primeiro lançamento, mas pode ser ajustado pelo gerente de lançamento de cada filial. Todas as versões do Python 2 atingiram o fim da vida útil.
