Repository: rffontenelle/devguide-pt-br
Catalog: getting-started/git-boot-camp.po
Languages: pt_br

source: Git Bootcamp and Cheat Sheet
pt_br: Git Bootcamp e Página de Dicas

source: This section provides instructions on common tasks in CPython's workflow. It's designed to assist new contributors who have some familiarity with git and GitHub.
pt_br: Esta seção fornece instruções sobre tarefas comuns no fluxo de trabalho do CPython. Ela foi projetado para ajudar novos contribuidores que tenham alguma familiaridade com git e GitHub.

source: If you are new to git and GitHub, please become comfortable with these instructions before submitting a pull request. As there are several ways to accomplish these tasks using git and GitHub, this section reflects one method suitable for new contributors. Experienced contributors may desire a different approach.
pt_br: Se você é novo no git e no GitHub, familiarize-se com estas instruções antes de enviar uma pull requests. Como existem várias maneiras de realizar essas tarefas usando git e GitHub, esta seção reflete um método adequado para novos contribuidores. Colaboradores experientes podem desejar uma abordagem diferente.

source: In this section, we will go over some commonly used Git commands that are relevant to CPython's workflow.
pt_br: Nesta seção, examinaremos alguns comandos do Git comumente usados que são relevantes para o fluxo de trabalho do CPython.

source: Setting up git aliases for common tasks can be useful to you. You can get more information about that in `git documentation <https://git-scm.com/book/en/v2/Git-Basics-Git-Aliases>`_
pt_br: A configuração de aliases git para tarefas comuns pode ser útil para você. Você pode obter mais informações sobre isso na `documentação do git <https://git-scm.com/book/en/v2/Git-Basics-Git-Aliases>`_ (em inglês).

source: Forking CPython GitHub Repository
pt_br: Fazendo fork do repositório GitHub do CPython

source: You will only need to do this once.
pt_br: Você só precisará fazer isso uma vez.

source: Go to https://github.com/python/cpython.
pt_br: Acesse https://github.com/python/cpython.

source: Press ``Fork`` on the top right.
pt_br: Pressione ``Fork`` no canto diretório superior

source: When asked where to fork the repository, choose to fork it to your username.
pt_br: Quando perguntado onde bifurcar o repositório, escolha bifurcar para seu nome de usuário.

source: Your forked CPython repository will be created at https://github.com/<username>/cpython.
pt_br: Seu repositório fork do CPython será criado em https://github.com/<usuário>/cpython.

source: Cloning a Forked CPython Repository
pt_br: Clonando o repositório fork do CPython

source: You will only need to do this once per machine. From your command line::
pt_br: Você só precisará fazer isso uma vez por máquina. Na sua linha de comando::

source: It is also recommended to configure an ``upstream`` remote repository::
pt_br: Também é recomendado configurar um repositório remoto ``upstream``::

source: You can also use SSH-based or HTTPS-based URLs.
pt_br: Você também pode usar URLs baseados em SSH ou HTTPS.

source: Configure the Remotes
pt_br: Configurar os controles remotos

source: Configure ``git`` to pull ``main`` from the ``upstream`` remote::
pt_br: Configure o ``git`` para fazer o pull do ``main`` do remoto ``upstream``::

source: Since one should never attempt to push to ``upstream``, configure ``git`` to push always to ``origin``::
pt_br: Como nunca se deve tentar fazer push para ``upstream``, configure ``git`` para enviar sempre para ``origin``::

source: Listing the Remote Repositories
pt_br: Listando os repositórios remotos

source: To list the remote repositories that are configured, along with their URLs::
pt_br: Para listar os repositórios remotos que estão configurados, junto com suas URLs::

source: You should have two remote repositories: ``origin`` pointing to your forked CPython repository, and ``upstream`` pointing to the official CPython repository::
pt_br: Você deve ter dois repositórios remotos: ``origin`` apontando para seu repositório fork do CPython, e ``upstream`` apontando para o repositório oficial do CPython::

source: To verify the upstream for ``main``::
pt_br: Para verificar o upstream para ``main``::

source: It should emit ``upstream``, indicating to track/pull changes for ``main`` from the ``upstream`` remote.
pt_br: Isso deve emitir ``upstream``, indicando para rastrear/fazer pull de alterações para ``main`` do remoto ``upstream``.

source: Setting Up Your Name and Email Address
pt_br: Configurando seu nome e endereço de e-mail

source: The ``--global`` flag sets these parameters globally while the ``--local`` flag sets them only for the current project.
pt_br: O sinalizador ``--global`` define esses parâmetros globalmente, enquanto o sinalizador ``--local`` os define apenas para o projeto atual.

source: Enabling ``autocrlf`` on Windows
pt_br: Habilitando o ``autocrlf`` no Windows

source: The ``autocrlf`` option will fix automatically any Windows-specific line endings. This should be enabled on Windows, since the public repository has a hook which will reject all changesets having the wrong line endings::
pt_br: A opção ``autocrlf`` corrigirá automaticamente quaisquer terminações de linha específicas do Windows. Isso deve ser ativado no Windows, pois o repositório público possui um gancho que rejeitará todos os conjuntos de alterações com finais de linha incorretos::

source: Creating and Switching Branches
pt_br: Criando e alternando branches

source: Never commit directly to the ``main`` branch.
pt_br: Nunca se comprometa diretamente com o branch (ou ramificação) ``main``.

source: Create a new branch from ``main`` and switch to it::
pt_br: Crie um novo branch de ``main`` e mude para elo::

source: This is equivalent to::
pt_br: Isso é equivalente a::

source: To find the branch you are currently on::
pt_br: Para encontrar o branch em que você está atualmente::

source: The current branch will have an asterisk next to the branch name. Note, this will only list all of your local branches.
pt_br: O branch atual terá um asterisco ao lado do nome do branch. Observe que isso listará apenas todos os branches locais.

source: To list all the branches, including the remote branches::
pt_br: Para listar todos os branches, incluindo os remotos::

source: To switch to a different branch::
pt_br: Para mudar para um ramo diferente::

source: Other releases are just branches in the repository. For example, to work on the 2.7 release from the ``upstream`` remote::
pt_br: Outros lançamentos são apenas branches no repositório. Por exemplo, para trabalhar na versão 2.7 do remoto ``upstream``::

source: Deleting Branches
pt_br: Excluindo branches

source: To delete a **local** branch that you no longer need::
pt_br: Para excluir um branch **local** que não é mais necessária::

source: To delete a **remote** branch::
pt_br: Para excluir um branch **remoto**:

source: You may specify more than one branch for deletion.
pt_br: Você pode especificar mais de uma ramificação para exclusão.

source: Renaming Branch
pt_br: Renomeando branches

source: The CPython repository's default branch was renamed from ``master`` to ``main`` after the Python 3.10b1 release.
pt_br: O branch padrão do repositório CPython foi renomeada de ``master`` para ``main`` após o lançamento do Python 3.10b1.

source: If you have a fork on GitHub (as described in :ref:`fork-cpython`) that was created before the rename, you should visit the GitHub page for your fork to rename the branch there. You only have to do this once. GitHub should provide you with a dialog for this. If it doesn't (or the dialog was already dismissed), you can rename the branch in your fork manually `by following these GitHub instructions <https://github.com/github/renaming#renaming-existing-branches>`__
pt_br: Se você tiver um fork no GitHub (conforme descrito em :ref:`fork-cpython`) que foi criado antes da renomeação, você deve visitar a página do GitHub do seu fork para renomear o branch lá. Você só tem que fazer isso uma vez. O GitHub deve fornecer uma caixa de diálogo para isso. Se isso não acontecer (ou a caixa de diálogo já foi descartada), você pode renomear o branch em seu fork manualmente `seguindo estas instruções do GitHub <https://github.com/github/renaming#renaming-existing-branches>`__ (em inglês).

source: After renaming the branch in your fork, you need to update any local clones as well. This only has to be done once per clone::
pt_br: Depois de renomear o branch do seu fork, você também precisa atualizar todos os clones locais. Isso só precisa ser feito uma vez por clone::

source: (GitHub also provides these instructions after you rename the branch.)
pt_br: (O GitHub também fornece essas instruções depois que você renomeia o branch.)

source: If you do not have a fork on GitHub, but rather a direct clone of the main repo created before the branch rename, you still have to update your local clones. This still only has to be done once per clone. In that case, you can rename your local branch as follows::
pt_br: Se você não tiver um fork no GitHub, mas sim um clone direto do repositório principal criado antes da renomeação do branch, ainda precisará atualizar seus clones locais. Isso ainda só precisa ser feito uma vez por clone. Nesse caso, você pode renomear sua filial local da seguinte maneira::

source: Staging and Committing Files
pt_br: Preparando e fazendo commit de arquivos

source: To show the current changes::
pt_br: Para mostrar as mudanças atuais::

source: To stage the files to be included in your commit::
pt_br: Para preparar os arquivos a serem incluídos no seu commit::

source: To commit the files that have been staged (done in step 2):
pt_br: Para fazer commit dos arquivos que foram preparados (feito na etapa 2):

source: Reverting Changes
pt_br: Revertendo mudanças

source: To revert changes to a file that has not been committed yet::
pt_br: Para reverter as mudanças a um arquivo do qual ainda não foi feito commit::

source: If the change has been committed, and now you want to reset it to whatever the origin is at::
pt_br: Se já foi feito commit da alteração e agora você deseja redefini-la para qualquer que seja a origem::

source: Stashing Changes
pt_br: Fazendo stash das alterações

source: To stash away changes that are not ready to be committed yet::
pt_br: Para fazer stash, isto é, para guardar as alterações que ainda não estão prontas para o commit::

source: To re-apply the last stashed change::
pt_br: Para reaplicar a última alteração guardada::

source: Comparing Changes
pt_br: Comparando alterações

source: View all non-commited changes::
pt_br: Ver todas as alterações que ainda não commitadas::

source: Compare to the ``main`` branch::
pt_br: Comparar com o branch ``main``::

source: Exclude generated files from diff using an ``attr`` `pathspec <https://git-scm.com/docs/gitglossary#def_pathspec>`_ (note the single quotes)::
pt_br: Excluir os arquivos gerados do diff usando um `pathspec <https://git-scm.com/docs/gitglossary#def_pathspec>`_ ``attr`` (observe as aspas simples)::

source: Exclude generated files from diff by default::
pt_br: Excluir arquivos gerados do diff por padrão::

source: The ``generated`` `attribute <https://git-scm.com/docs/gitattributes>`_ is defined in :cpy-file:`.gitattributes`, found in the repository root.
pt_br: O `atributo <https://git-scm.com/docs/gitattributes>`_ ``generated`` é definido em :cpy-file:`.gitattributes`, encontrado na raiz do repositório.

source: Pushing Changes
pt_br: Fazendo push das alterações

source: Once your changes are ready for a review or a pull request, you will need to push them to the remote repository.
pt_br: Assim que suas alterações estiverem prontas para revisão para ou pull request, você precisará enviá-las para o repositório remoto.

source: Creating a Pull Request
pt_br: Criando uma pull request

source: Press the ``New pull request`` button.
pt_br: Pressione o botão ``New pull request``.

source: Click the ``compare across forks`` link.
pt_br: Clique no link ``compare through forks``.

source: Select the base repository: ``python/cpython`` and base branch: ``main``.
pt_br: Selecione o repositório base: ``python/cpython`` e o branch base: ``main``.

source: Select the head repository: ``<username>/cpython`` and head branch: the branch containing your changes.
pt_br: Selecione o repositório principal: ``<usuário>/cpython`` e o branch principal: o branch que contém suas alterações.

source: Press the ``Create pull request`` button.
pt_br: Pressione o botão ``Create pull request``.

source: You should include the issue number in the title of the PR, in the format ``gh-NNNNN: <PR Title>``.
pt_br: Você deve incluir o número do issue no título do PR, no formato ``gh-NNNNN: <Título da PR>``.

source: Linking to Issues and Pull Requests
pt_br: Vinculando a issues e pull requests

source: You can link to issues and pull requests using ``gh-NNNNN`` (this form is preferred over ``#NNNNN``). If the reference appears in a list, the link will be expanded to show the status and title of the issue/PR.
pt_br: Você pode vincular issues e pull requests usando ``gh-NNNNN`` (esta forma é preferível a ``#NNNNN``). Se a referência aparecer em uma lista, o link será expandido para mostrar o status e o título do issue/PR.

source: When you create a PR that includes ``gh-NNNNN`` in the title, `bedevere`_ will automatically add a link to the issue in the first message.
pt_br: Quando você cria um PR que inclui ``gh-NNNNN`` no título, `bedevere`_ irá adicionar automaticamente um link para o problema na primeira mensagem.

source: In addition, pull requests support `special keywords`_ that can be used to link to an issue and automatically close it when the PR is merged. However, issues often require multiple PRs before they can be closed (e.g. backports to other branches), so this features is only useful if you know for sure that a single PR is enough to address and close the issue.
pt_br: Além disso, as pull requests têm suporte a `palavras-chave especiais`_ que podem ser usadas para vincular a um issue e fechá-lo automaticamente quando a PR é mesclado. No entanto, os issues geralmente exigem várias PRs antes de serem fechadas (por exemplo, backports para outros branches), portanto, esse recurso só é útil se você tiver certeza de que um único PR é suficiente para resolver e encerrar o problema.

source: Updating your CPython Fork
pt_br: Atualizando seu fork do CPython

source: Scenario:
pt_br: Cenário:

source: You forked the CPython repository some time ago.
pt_br: Você criou o fork do repositório CPython há algum tempo.

source: Time passes.
pt_br: O tempo passa.

source: There have been new commits made in the upstream CPython repository.
pt_br: Houve novos commits feitos no repositório CPython upstream.

source: Your forked CPython repository is no longer up to date.
pt_br: Seu repositório bifurcado do CPython não está mais atualizado.

source: You now want to update your forked CPython repository to be the same as the upstream CPython repository.
pt_br: Agora você deseja atualizar seu repositório bifurcado do CPython para ser o mesmo que o repositório upstream do CPython.

source: Please do not try to solve this by creating a pull request from ``python:main`` to ``<username>:main`` as the authors of the patches will get notified unnecessarily.
pt_br: Por favor, não tente resolver isso criando uma pull request de ``python:main`` para ``<usuário>:main``, pois os autores dos patches serão notificados desnecessariamente.

source: Solution::
pt_br: Solução

source: For the above commands to work, please follow the instructions found in the :ref:`checkout` section
pt_br: Para que os comandos acima funcionem, siga as instruções encontradas na seção :ref:`checkout`

source: Another scenario:
pt_br: Outro cenário:

source: You created ``some-branch`` some time ago.
pt_br: Você criou ``some-branch`` há algum tempo.

source: You made some commits to ``some-branch``.
pt_br: Você fez alguns commits em ``some-branch``.

source: Meanwhile, there are recent changes from the upstream CPython repository.
pt_br: Enquanto isso, há mudanças recentes do repositório CPython upstream.

source: You want to incorporate the recent changes from the upstream CPython repository into ``some-branch``.
pt_br: Você deseja incorporar as mudanças recentes do repositório upstream CPython em ``some-branch``.

source: You may see error messages like "CONFLICT" and "Automatic merge failed;" when you run ``git merge upstream/main``.
pt_br: Você pode ver mensagens de erro como "CONFLICT" e "Automatic merge failed;" ao executar ``git merge upstream/main``.

source: When it happens, you need to resolve conflict. See these articles about resolving conflicts:
pt_br: Quando isso acontece, você precisa resolver o conflito. Veja estes artigos sobre resolução de conflitos (em inglês):

source: `About merge conflicts <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/addressing-merge-conflicts/about-merge-conflicts>`_
pt_br: `Sobre conflitos de mesclagem <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/addressing-merge-conflicts/about-merge-conflicts>`_

source: `Resolving a merge conflict using the command line <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/addressing-merge-conflicts/resolving-a-merge-conflict-using-the-command-line>`_
pt_br: `Resolvendo um conflito de mesclagem usando a linha de comando <https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/addressing-merge-conflicts/resolving-a-merge-conflict-using-the-command-line>`_

source: Applying a Patch to Git
pt_br: Aplicando um patch ao Git

source: A patch exists but there is no pull request for it.
pt_br: Existe um patch, mas não há pull request para ele.

source: Solution:
pt_br: Solução:

source: Download the patch locally.
pt_br: Baixe o patch localmente.

source: Apply the patch::
pt_br: Aplique o patch::

source: If there are errors, update to a revision from when the patch was created and then try the ``git apply`` again:
pt_br: Se houver erros, atualize para uma revisão de quando o patch foi criado e tente o ``git apply`` novamente:

source: If the patch still won't apply, then a patch tool will not be able to apply the patch and it will need to be re-implemented manually.
pt_br: Se o patch ainda não for aplicado, uma ferramenta de patch não poderá aplicá-lo e precisará ser reimplementado manualmente.

source: If the apply was successful, create a new branch and switch to it.
pt_br: Se a aplicação for bem-sucedida, crie um novo branch e mude para ele.

source: Stage and commit the changes.
pt_br: Prepare e faça commit das alterações.

source: If the patch was applied to an old revision, it needs to be updated and merge conflicts need to be resolved::
pt_br: Se o patch foi aplicado a uma revisão antiga, ele precisa ser atualizado e os conflitos de mesclagem precisam ser resolvidos::

source: For very old changes, ``git merge --no-ff`` may be easier than a rebase, with regards to resolving conflicts.
pt_br: Para mudanças muito antigas, ``git merge --no-ff`` pode ser mais fácil do que um rebase, no que diz respeito à resolução de conflitos.

source: Push the changes and open a pull request.
pt_br: Faça das alterações e abra uma pull request.

source: Downloading Other's Patches
pt_br: Baixando patches dos outros

source: A contributor made a pull request to CPython.
pt_br: Um colaborador fez uma pull request para CPython.

source: Before merging it, you want to be able to test their changes locally.
pt_br: Antes de mesclá-la, você deseja poder testar suas alterações localmente.

source: If you've got `GitHub CLI <https://cli.github.com>`_ or `hub <https://hub.github.com>`_ installed, you can simply do::
pt_br: Se você tem `GitHub CLI <https://cli.github.com>`_ ou `hub <https://hub.github.com>`_ instalado, você pode simplesmente fazer::

source: Both of these tools will configure a remote URL for the branch, so you can ``git push`` if the pull request author checked "Allow edits from maintainers" when creating the pull request.
pt_br: Ambas as ferramentas irão configurar uma URL remota para o branch, então você pode fazer ``git push`` se o autor da pull request marcou "Allow edits from maintainers" (para permitir edições dos mantenedores) ao criar a pull request.

source: If you don't have GitHub CLI or hub installed, you can set up a git alias. On Unix and macOS::
pt_br: Se você não tiver o GitHub CLI ou hub instalado, poderá configurar um git alias. No Unix e macOS::

source: On Windows, reverse the single (``'``) and double (``"``) quotes:
pt_br: No Windows, inverta as aspas simples (``'``) e duplas (``"``):

source: The alias only needs to be done once. After the alias is set up, you can get a local copy of a pull request as follows::
pt_br: O alias só precisa ser feito uma vez. Após a configuração do alias, você pode obter uma cópia local de uma pull request da seguinte forma::

source: Accepting and Merging a Pull Request
pt_br: Aceitando e mesclando uma solicitação pull

source: Pull requests can be accepted and merged by a Python Core Developer.
pt_br: As solicitações pull podem ser aceitas e mescladas por um Python Core Developer.

source: At the bottom of the pull request page, click the ``Squash and merge`` button.
pt_br: Na parte inferior da página de pull request, clique no botão ``Squash and merge``.

source: Replace the reference to GitHub pull request ``#NNNN`` with ``GH-NNNN``. If the title is too long, the pull request number can be added to the message body.
pt_br: Substitua a referência à pull request do GitHub ``#NNNN`` por ``GH-NNNN``. Se o título for muito longo, o número da solicitação pull pode ser adicionado ao corpo da mensagem.

source: Adjust and clean up the commit message.
pt_br: Ajuste e limpe a mensagem de commit.

source: Example of good commit message::
pt_br: Exemplo de mensagem de commit boa::

source: Example of bad commit message::
pt_br: Exemplo de mensagem de commit ruim::

source: `How to Write a Git Commit Message <https://cbea.ms/git-commit/>`_ is a nice article describing how to write a good commit message.
pt_br: `How to Write a Git Commit Message <https://cbea.ms/git-commit/>`_ é um bom artigo (em inglês) que descreve como escrever uma boa mensagem de commit.

source: Press the ``Confirm squash and merge`` button.
pt_br: Pressione o botão ``Confirm squash and merge``

source: Backporting Merged Changes
pt_br: Fazendo backport de alterações mescladas

source: A pull request may need to be backported into one of the maintenance branches after it has been accepted and merged into ``main``. It is usually indicated by the label ``needs backport to X.Y`` on the pull request itself.
pt_br: Uma pull request pode precisar ser portada para um dos branches de manutenção depois de ser aceita e mesclada em ``principal``. Geralmente é indicado pelo rótulo ``precisa de backport para X.Y`` na própria pull request.

source: Use the utility script `cherry_picker.py <https://github.com/python/cherry-picker>`_ from the `core-workflow <https://github.com/python/core-workflow>`_ repository to backport the commit.
pt_br: Use o script utilitário `cherry_picker.py <https://github.com/python/cherry-picker>`_ do repositório `core-workflow <https://github.com/python/core-workflow>`_ para backport do commit.

source: The commit hash for backporting is the squashed commit that was merged to the ``main`` branch. On the merged pull request, scroll to the bottom of the page. Find the event that says something like::
pt_br: O hash de commit para backporting é o commit compactado que foi mesclado ao branch ``main``. Na solicitação pull mesclada, role até a parte inferior da página. Encontre o evento que diz algo como::
