Repository: rffontenelle/devguide-pt-br
Catalog: getting-started/git-boot-camp.po
Languages: pt_br

source: By following the link to ``<commit_sha1>``, you will get the full commit hash.
pt_br: Seguindo o link para ``<commit_sha1>``, você obterá o hash completo do commit.

source: Alternatively, the commit hash can also be obtained by the following git commands:
pt_br: Como alternativa, o hash de confirmação também pode ser obtido pelos seguintes comandos git:

source: The above commands will print out the hash of the commit containing ``"gh-12345"`` as part of the commit message.
pt_br: Os comandos acima imprimirão o hash do commit contendo ``"gh-12345"`` como parte da mensagem do commit.

source: When formatting the commit message for a backport commit: leave the original one as is and delete the number of the backport pull request.
pt_br: Ao formatar a mensagem de confirmação para uma confirmação de backport: deixe a original como está e exclua o número da solicitação pull de backport.

source: Example of good backport commit message::
pt_br: Exemplo de uma mensagem de commit de backport boa::

source: Example of bad backport commit message::
pt_br: Exemplo de uma mensagem de commit de backport ruim::

source: Editing a Pull Request Prior to Merging
pt_br: Editando uma pull request antes da mesclá-la

source: When a pull request submitter has enabled the `Allow edits from maintainers`_ option, Python Core Developers may decide to make any remaining edits needed prior to merging themselves, rather than asking the submitter to do them. This can be particularly appropriate when the remaining changes are bookkeeping items like updating ``Misc/ACKS``.
pt_br: Quando um remetente de pull request habilitou a opção `Allow edits from maintainers`_, os desenvolvedores principais do Python podem decidir fazer eles mesmos as edições restantes necessárias antes de mesclarem, em vez de pedir ao remetente para fazê-las. Isso pode ser particularmente apropriado quando as alterações restantes são itens de contabilidade, como atualização de ``Misc/ACKS``.

source: To edit an open pull request that targets ``main``:
pt_br: Para editar uma pull request aberta que tenha como alvo ``main``:

source: In the pull request page, under the description, there is some information about the contributor's forked CPython repository and branch name that will be useful later::
pt_br: Na página da pull request, abaixo da descrição, há algumas informações sobre o repositório fork do CPython do contribuidor e o nome do branch que serão úteis mais tarde::

source: Fetch the pull request, using the :ref:`git pr <git_pr>` alias::
pt_br: Obtenha a solicitação pull, usando o alias :ref:`git pr <git_pr>`::

source: This will checkout the contributor's branch at ``<pr_number>``.
pt_br: Isso fará o checkout do branch do contribuidor em ``<pr_number>``.

source: Make and commit your changes on the branch. For example, merge in changes made to ``main`` since the PR was submitted (any merge commits will be removed by the later ``Squash and Merge`` when accepting the change):
pt_br: Edite e faça commit das suas alterações no branch. Por exemplo, merclar em alterações feitas em ``main`` desde que o PR foi submetido (qualquer commit de mesclagem será removido pelo ``Squash and Merge`` posterior ao aceitar a alteração):

source: Push the changes back to the contributor's PR branch::
pt_br: Faça o push das alterações de volta para o branch da PR do colaborador::

source: Optionally, :ref:`delete the PR branch <deleting_branches>`.
pt_br: Opcionalmente, :ref:`exclua o branch da PR <deleting_branches>`.

source: `GitHub CLI <https://cli.github.com>`_ is a command-line interface that allows you to create, update, and check GitHub issues and pull requests.
pt_br: `GitHub CLI <https://cli.github.com>`_ é uma interface de linha de comando que permite criar, atualizar e verificar issues e pull requests do GitHub.

source: You can install GitHub CLI `by following these instructions <https://github.com/cli/cli#installation>`_. After installing, you need to authenticate::
pt_br: Você pode instalar o GitHub CLI `seguindo estas instruções <https://github.com/cli/cli#installation>`_. Após a instalação, você precisa autenticar::

source: Examples of useful commands:
pt_br: Exemplos de comandos úteis:

source: Create a PR::
pt_br: Criar um PR::

source: Check out another PR::
pt_br: Fazer checkout de outra PR::

source: Set ``ssh`` as the Git protocol::
pt_br: Definir ``ssh`` como o protocolo Git::

source: Set the browser::
pt_br: Definir o navegador::
