Repository: rffontenelle/devguide-pt-br
Catalog: core-developers/become-core-developer.po
Languages: pt_br

source: How to Become a Core Developer
pt_br: Como se tornar um desenvolvedor core

source: What it Takes
pt_br: O que é preciso

source: When you have consistently contributed patches which meet quality standards without requiring extensive rewrites prior to being committed, you may qualify for commit privileges and become a core developer of Python. You must also work well with other core developers (and people in general) as you become an ambassador for the Python project.
pt_br: Quando você contribui consistentemente com patches que atendem aos padrões de qualidade sem exigir reescritas extensas antes de ser confirmado, você pode se qualificar para privilégios de fazer commits e se tornar um desenvolvedor core do Python. Você também deve trabalhar bem com outros desenvolvedores cores (e pessoas em geral) ao se tornar um embaixador do projeto Python.

source: Typically a core developer will offer you the chance to gain commit privilege. The person making the offer will become your mentor and watch your commits for a while to make sure you understand the development process. If other core developers agree that you should gain commit privileges you are then extended an official offer. How core developers come to that agreement are outlined in :pep:`13`.
pt_br: Normalmente, um desenvolvedor core oferece a você a chance de obter privilégio de fazer commits. A pessoa que fizer a oferta se tornará seu mentor e observará seus commits por um tempo para garantir que você entenda o processo de desenvolvimento. Se outros desenvolvedores principais concordarem que você deve obter privilégios de fazer commits, você receberá uma oferta oficial. Como os desenvolvedores cores chegam a esse acordo está descrito em :pep:`13`.

source: Gaining Commit Privileges
pt_br: Ganhando privilégios de fazer commit

source: The steps to gaining commit privileges are:
pt_br: As etapas para obter privilégios de fazer commit são:

source: A core developer starts a poll in the `Committers category`_ on the `Python Discourse`_ (``discuss.python.org``)
pt_br: Um desenvolvedor core inicia uma votação na `categoria Committers`_ no `Python Discourse`_ (``discuss.python.org``)

source: Open for 7 days
pt_br: Aberta por 7 dias

source: Results shown upon close
pt_br: Resultados mostrados ao fechar

source: The poll is announced on the `python-committers mailing list`_
pt_br: A votação é anunciada na lista de discussão `python-committers`_

source: Wait for the poll to close and see if the results confirm your membership as per the voting results required by :pep:`13`
pt_br: Aguarde o encerramento da votação e veja se os resultados confirmam sua adesão de acordo com os resultados da votação exigidos pela :pep:`13`

source: The person who nominated you emails the steering council with your email address and a request that the council either accept or reject the proposed membership
pt_br: A pessoa que indicou você envia um e-mail ao conselho diretor com seu endereço de e-mail e uma solicitação para que o conselho aceite ou rejeite a adesão proposta

source: Assuming the steering council does not object, a member of the council will email you asking for:
pt_br: Supondo que o conselho diretor não se oponha, um membro do conselho enviará um e-mail a você solicitando:

source: Account details as required by 🔒 https://github.com/python/voters/
pt_br: Detalhes da conta conforme exigido por 🔒 https://github.com/python/voters/

source: Your preferred email address to subscribe to the python-committers mailing list with
pt_br: Seu endereço de e-mail preferido para se inscrever na lista de discussão python-committers com

source: A reminder about the `Code of Conduct`_ and to report issues to the PSF Conduct WG
pt_br: Um lembrete sobre o `Código de Conduta`_ e para relatar problemas ao PSF Conduct WG (em português, grupo de trabalho de conduta da PSF)

source: Once you have provided the pertinent details, your various new privileges will be turned on
pt_br: Depois de fornecer os detalhes pertinentes, seus vários novos privilégios serão ativados

source: Your details will be added to 🔒 https://github.com/python/voters/
pt_br: Seus detalhes serão adicionados a 🔒 https://github.com/python/voters/

source: They will update the devguide to publicly list your team membership at :ref:`developers`
pt_br: Eles atualizarão o guia de desenvolvimento para listar publicamente os membros de sua equipe em :ref:`developers`

source: An announcement email by the steering council member handling your new membership will be sent to the Committers Discourse category
pt_br: Um e-mail de anúncio do membro do conselho diretor que está lidando com sua nova associação será enviado para a categoria Comitters do Discourse
