Repository: rffontenelle/devguide-pt-br
Catalog: documentation/devguide.po
Languages: pt_br

source: Helping with the Developer's Guide
pt_br: Ajudando com o guia do desenvolvedor

source: The Developer's Guide (what you're reading now) uses the same process as the main Python documentation, except for some small differences. The source lives in a `separate repository`_ and bug reports should be submitted to the `devguide GitHub tracker`_.
pt_br: O guia do desenvolvedor (o que você está lendo agora) usa o mesmo processo da documentação principal do Python, exceto por algumas pequenas diferenças. A fonte reside em um `repositório separado`_ e relatórios de bugs devem ser enviados para o `rastreador do GitHub do devguide`_.

source: Our devguide workflow uses continuous integration and deployment so changes to the devguide are normally published when the pull request is merged. Changes to CPython documentation follow the workflow of a CPython release and are published in the release.
pt_br: Nosso fluxo de trabalho no devguide usa integração e implantação contínuas, de modo que as alterações no devguide são normalmente publicadas quando a pull request é mesclada. As alterações na documentação do CPython seguem o fluxo de trabalho de uma versão do CPython e são publicadas na versão.

source: Developer's Guide workflow
pt_br: Fluxo de trabalho do guia do desenvolvedor

source: To submit a :ref:`pull request <pullrequest>`, you can fork the `devguide repo`_ to your GitHub account and clone it using::
pt_br: Para enviar uma :ref:`pull request <pullrequest>`, você pode fazer um fork do `repositório do devguide`_ para sua conta GitHub e cloná-lo usando::

source: For your PR to be accepted, you will also need to sign the :ref:`contributor agreement <cla>`.
pt_br: Para que seu PR seja aceito, você também precisará assinar o :ref:`acordo de contribuidor <cla>`.

source: To build the devguide, some additional dependencies are required (most importantly, `Sphinx`_), and the standard way to install dependencies in Python projects is to create a virtualenv, and then install dependencies from a ``requirements.txt`` file. For your convenience, this is all *automated for you*. To build the devguide on a Unix-like system use::
pt_br: Para compilar o devguide, algumas dependências adicionais são necessárias (mais importante, `Sphinx`_), e a maneira padrão de instalar dependências em projetos Python é criar um virtualenv e, em seguida, instalar dependências de um arquivo ``requirements.txt``. Para sua conveniência, tudo isso é *automatizado para você*. Para compilar o devguide em um sistema semelhante ao Unix, use::

source: in the checkout directory. On Windows use:
pt_br: no diretório de checkout. No Windows use:

source: You will find the generated files in ``_build/html``.
pt_br: Você vai encontrar os arquivos gerados em ``_build/html``.

source: Replace ``html`` with ``htmlview`` to open the docs in a web browser once the build completes.
pt_br: Substitua ``html`` com ``htmlview`` para abrir a documentação em um navegador web assim que a compilação concluir.

source: Replace ``html`` with ``htmllive`` to rebuild the docs, start a local server, and automatically reload the page in your browser when you make changes to reST files (Unix only).
pt_br: Substitua ``html`` com ``htmllive`` para recompilar a documentação, iniciar um servidor local e automaticamente recarregar a página em seu navegador quando você fizer alterações aos arquivos reST (Unix apenas).

source: Note that ``make check`` runs automatically when you submit a :ref:`pull request <pullrequest>`. You may wish to run ``make check`` and ``make linkcheck`` to make sure that it runs without errors.
pt_br: Observe que ``make check`` é executado automaticamente quando você envia uma :ref:`pull request <pullrequest>`.
