Repository: rffontenelle/devguide-pt-br
Catalog: documentation/help-documenting.po
Languages: pt_br

source: Python is known for having well-written documentation. Maintaining the documentation's accuracy and keeping a high level of quality takes a lot of effort. Community members, like you, help with writing, editing, and updating content, and these contributions are appreciated and welcomed.
pt_br: Python é conhecido por ter uma documentação bem escrita. Manter a precisão da documentação e manter um alto nível de qualidade exige muito esforço. Os membros da comunidade, como você, ajudam a escrever, editar e atualizar o conteúdo, e essas contribuições são apreciadas e bem-vindas.

source: This high-level **Helping with Documentation** section provides:
pt_br: Esta seção **Ajudando com a documentação** de alto nível fornece:

source: an overview of Python's documentation
pt_br: uma visão geral da documentação do Python

source: how to help with documentation issues
pt_br: o como ajudar com problemas de documentação

source: information on proofreading
pt_br: informações sobre revisão

source: You will find extensive and detailed information on how to write documentation and submit changes on the :ref:`Documenting Python <documenting>` page.
pt_br: Você encontrará informações extensas e detalhadas sobre como escrever a documentação e enviar alterações na página :ref:`Documentando Python <documenting>`.

source: The :ref:`Documenting Python <documenting>` section covers the details of how Python's documentation works. It includes information about the markup language used, specific formats, and style recommendations. Looking at pre-existing documentation source files can be very helpful when getting started. :ref:`How to build the documentation <building-doc>` walks you through the steps to create a draft build which lets you see how your changes will look and validates that your new markup is correct.
pt_br: A seção :ref:`Documentando Python <documenting>` aborda os detalhes de como a documentação do Python funciona. Inclui informações sobre a linguagem de marcação usada, formatos específicos e recomendações de estilo. Observar os arquivos de origem da documentação pré-existente pode ser muito útil ao começar. :ref:`Como construir a documentação <building-doc>` orienta você através das etapas para criar um rascunho de compilação que permite ver como suas alterações ficarão e valida se sua nova marcação está correta.

source: You can view the documentation built from :ref:`in-development <indevbranch>` and :ref:`maintenance <maintbranch>` branches at https://docs.python.org/dev/. The in-development and recent maintenance branches are rebuilt once per day.
pt_br: Você pode ver a documentação construída a partir dos branches :ref:`em desenvolvimento <indevbranch>` e de :ref:`manutenção <maintbranch>` em https://docs.python.org/dev/. Os branches em desenvolvimento e de manutenção recente são recompilados uma vez por dia.

source: Helping with documentation issues
pt_br: Ajuda com problemas de documentação

source: If you look at `documentation issues`_ on the `issue tracker`_, you will find various documentation problems that may need work. Issues vary from typos to unclear documentation and items lacking documentation.
pt_br: Se você examinar os `problemas da documentação`_ no `rastreador de problemas`_, encontrará vários problemas de documentação que podem precisar de correção. Os problemas variam de erros de digitação a documentação pouco clara e itens sem documentação.

source: If you see a documentation issue that you would like to tackle, you can:
pt_br: Se você encontrar um problema de documentação que gostaria de resolver, você pode:

source: check to see if there is pull request icon to the right of the issue's title, or an open pull request listed under :guilabel:`Linked PRs` in the issue body. If there is, then someone has already created a pull request for the issue.
pt_br: verificar se há um ícone de pull request à direita do título do issue, ou um pull request aberto listado em :guilabel:`Linked PRs` no corpo do problema. Se houver, então alguém já criou um pull request para o issue.

source: leave a comment on the issue saying you are going to try and create a pull request and roughly how long you think you will take to do so (this allows others to take on the issue if you happen to forget or lose interest).
pt_br: deixar um comentário sobre o problema dizendo que você vai tentar criar um pull request e aproximadamente quanto tempo você acha que levará para fazê-lo (isso permite que outras pessoas assumam o problema se você esquecer ou perder o interesse).

source: submit a :ref:`pull request <pullrequest>` for the issue.
pt_br: enviar uma :ref:`pull request <pullrequest>` para o problema.

source: By following the steps in the :ref:`Quick Guide to Pull Requests <pullrequest-quickguide>`, you will learn the workflow for documentation pull requests.
pt_br: Seguindo as etapas do :ref:`Guia rápido para pull requests <pullrequest-quickguide>`, você aprenderá o fluxo de trabalho para pull requests da documentação.

source: Proofreading
pt_br: Revisando

source: While an issue filed on the `issue tracker`_ means there is a known issue somewhere, that does not mean there are not other issues lurking about in the documentation. Proofreading a part of the documentation, such as a "How to" or OS specific document, can often uncover problems (e.g., documentation that needs updating for Python 3).
pt_br: Embora um problema registrado no `rastreador de problemas`_ signifique que há um problema conhecido em algum lugar, isso não significa que não haja outros problemas ocultos na documentação. A revisão de uma parte da documentação, como um "HOWTO" ou um documento específico do sistema operacional, geralmente pode revelar problemas (por exemplo, documentação que precisa ser atualizada para o Python 3).

source: If you decide to proofread, read a section of the documentation from start to finish, filing issues in the issue tracker for each major type of problem you find. Simple typos don't require issues of their own, but, instead, submit a pull request directly. It's best to avoid filing a single issue for an entire section containing multiple problems; instead, file several issues so that it is easier to break the work up for multiple people and more efficient review.
pt_br: Se você decidir revisar, leia uma seção da documentação do início ao fim, registrando problemas no rastreador de problemas para cada tipo de problema principal que encontrar. Erros de digitação simples não exigem relatórios de problema próprios, mas, em vez disso, envie uma pull request diretamente. É melhor evitar criar um único relatório problema para uma seção inteira contendo vários problemas; em vez disso, registre vários relatórios de problemas para que seja mais fácil dividir o trabalho para várias pessoas e uma revisão mais eficiente.
