Repository: rffontenelle/devguide-pt-br
Catalog: documentation/start-documenting.po
Languages: pt_br

source: Getting started
pt_br: Primeiros passos

source: The Python language has a substantial body of documentation, much of it contributed by various authors. The markup used for the Python documentation is `reStructuredText`_, developed by the `docutils`_ project, amended by custom directives and using a toolset named `Sphinx`_ to post-process the HTML output.
pt_br: A linguagem Python possui um corpo substancial de documentação, grande parte dela contribuída por vários autores. A marcação usada para a documentação do Python é `reStructuredText`_, desenvolvida pelo projeto `docutils`_, alterada por diretivas personalizadas e usando um conjunto de ferramentas chamado `Sphinx`_ para pós-processar a saída HTML.

source: The documentation in HTML, PDF or EPUB format is generated from text files written using the :ref:`reStructuredText format <markup>` and contained in the :ref:`CPython Git repository <setup>`.
pt_br: A documentação em formato HTML, PDF ou EPUB é gerada a partir de arquivos de texto escritos no :ref:`formato reStructuredText <markup>` e contidos no :ref:`repositório CPython Git <setup>`.

source: If you're interested in contributing to Python's documentation, there's no need to write reStructuredText if you're not so inclined; plain text contributions are more than welcome as well. Send an e-mail to docs@python.org or open an issue on the :ref:`tracker <reporting-bugs>`.
pt_br: Se você estiver interessado em contribuir com a documentação do Python, não há necessidade de escrever reStructuredText se você não quiser; contribuições em texto simples também são mais que bem-vindas. Envie um e-mail para docs@python.org ou abra um relatório de problema no :ref:`rastreador <reporting-bugs>`.

source: Introduction
pt_br: Introdução

source: Python's documentation has long been considered to be good for a free programming language. There are a number of reasons for this, the most important being the early commitment of Python's creator, Guido van Rossum, to providing documentation on the language and its libraries, and the continuing involvement of the user community in providing assistance for creating and maintaining documentation.
pt_br: A documentação do Python há muito é considerada boa para uma linguagem de programação livre. Há uma série de razões para isso, sendo a mais importante o compromisso inicial do criador do Python, Guido van Rossum, em fornecer documentação sobre a linguagem e suas bibliotecas, e o envolvimento contínuo da comunidade de usuários no fornecimento de assistência para a criação e manutenção de documentação.

source: The involvement of the community takes many forms, from authoring to bug reports to just plain complaining when the documentation could be more complete or easier to use.
pt_br: O envolvimento da comunidade assume muitas formas, desde a criação de relatórios de bugs até simplesmente reclamar quando a documentação poderia ser mais completa ou mais fácil de usar.

source: This section is aimed at authors and potential authors of documentation for Python. More specifically, it is for people contributing to the standard documentation and developing additional documents using the same tools as the standard documents. This guide will be less useful for authors using the Python documentation tools for topics other than Python, and less useful still for authors not using the tools at all.
pt_br: Esta seção é destinada a autores e potenciais autores de documentação para Python. Mais especificamente, destina-se a pessoas que contribuem para a documentação padrão e desenvolvem documentos adicionais utilizando as mesmas ferramentas dos documentos padrão. Este guia será menos útil para autores que usam as ferramentas de documentação do Python para tópicos diferentes do Python, e menos útil ainda para autores que não usam as ferramentas.

source: If your interest is in contributing to the Python documentation, but you don't have the time or inclination to learn reStructuredText and the markup structures documented here, there's a welcoming place for you among the Python contributors as well. Any time you feel that you can clarify existing documentation or provide documentation that's missing, the existing documentation team will gladly work with you to integrate your text, dealing with the markup for you. Please don't let the material in this section stand between the documentation and your desire to help out!
pt_br: Se o seu interesse é contribuir para a documentação do Python, mas você não tem tempo ou disposição para aprender reStructuredText e as estruturas de marcação documentadas aqui, há um lugar acolhedor para você entre os contribuidores do Python também. Sempre que você achar que pode esclarecer a documentação existente ou fornecer a documentação que está faltando, a equipe de documentação existente terá prazer em trabalhar com você para integrar seu texto, lidando com a marcação para você. Por favor, não deixe que o material desta seção se interponha entre a documentação e o seu desejo de ajudar!

source: Building the documentation
pt_br: Construindo a documentação

source: To build the documentation, follow the steps in one of the sections below. You can view the documentation after building the HTML by opening the file :file:`Doc/build/html/index.html` in a web browser.
pt_br: Para construir a documentação, siga as etapas em uma das seções abaixo. Você pode visualizar a documentação após construir o HTML abrindo o arquivo :file:`Doc/build/html/index.html` em um navegador web.

source: The following instructions all assume your current working dir is the ``Doc`` subdirectory in your :ref:`CPython repository clone <checkout>`. Make sure to switch to it with ``cd Doc`` if necessary.
pt_br: Todas as instruções a seguir assumem que seu diretório de trabalho atual é o subdiretório Doc em seu :ref:`clone do repositório CPython <checkout>`. Certifique-se de mudar para ele com ``cd Doc``, se necessário.

source: Create a virtual environment
pt_br: Criar um ambiente virtual

source: **On Unix platforms** that support :program:`make` (including Linux, macOS and BSD), you can create a new :mod:`venv` with the required dependencies using::
pt_br: **Em plataformas Unix** compatíveis com :program:`make` (incluindo Linux, macOS e BSD), você pode criar um novo :mod:`venv` com as dependências necessárias usando::

source: Building the docs with :program:`make` will automatically use this environment without you having to activate it.
pt_br: Construir os documentos com :program:`make` usará automaticamente este ambiente sem que você precise ativá-lo.

source: **On Windows**, or if not using :program:`make`, `create a new virtual environment <venv-create_>`__ manually. Always be sure to `activate this environment <venv-activate_>`__ before building the documentation.
pt_br: **No Windows**, ou se não estiver usando :program:`make`, `crie um novo ambiente virtual <venv-create_>`__ manualmente. Certifique-se sempre de `ativar este ambiente <venv-activate_>`__ antes de construir a documentação.

source: Build using make / make.bat
pt_br: Construir usando make / make.bat

source: A Unix ``Makefile`` is provided, :cpy-file:`Doc/Makefile`, along with a :cpy-file:`Doc/make.bat` batch file for Windows that attempts to emulate it as closely as practical.
pt_br: Um ``Makefile`` de Unix é fornecido, :cpy-file:`Doc/Makefile`, junto com um arquivo em lote (ou "batch") :cpy-file:`Doc/make.bat` para Windows que tenta emulá-lo o mais próximo possível.

source: The Windows ``make.bat`` batch file lacks a ``make venv`` target. Instead, it automatically installs any missing dependencies into the currently activated environment (or the base Python, if none). Make sure the environment you :ref:`created above <doc-create-venv-windows>` is `activated <venv-activate_>`__ before running ``make.bat``.
pt_br: O arquivo em lote ``make.bat`` do Windows não possui um alvo ``make venv``. Em vez disso, ele instala automaticamente quaisquer dependências ausentes no ambiente atualmente ativado (ou no Python base, se não houver). Certifique-se de que o ambiente que você :ref:`criou acima <doc-create-venv-windows>` esteja `ativado <venv-activate_>`__ antes de executar ``make.bat``.

source: To build the docs as HTML, run::
pt_br: Para construir a documentação como HTML, execute::

source: Replace ``html`` with ``htmlview`` to open the docs in a web browser once the build completes.
pt_br: Substitua ``html`` com ``htmlview`` para abrir a documentação em um navegador web assim que a compilação concluir.

source: Replace ``html`` with ``htmllive`` to rebuild the docs, start a local server, and automatically reload the page in your browser when you make changes to reST files (Unix only).
pt_br: Substitua ``html`` com ``htmllive`` para recompilar a documentação, iniciar um servidor local e automaticamente recarregar a página em seu navegador quando você fizer alterações aos arquivos reST (Unix apenas).

source: To check the docs for common errors with `Sphinx Lint`_ (which is run on all :ref:`pull requests <pullrequest>`), use::
pt_br: Para verificar os documentos em busca de erros comuns com o `Sphinx Lint`_ (que é executado em todas as :ref:`pull requests <pullrequest>`), use::

source: To list other supported :program:`make` targets, run::
pt_br: Para listar outros alvos suportados do :program:`make`, execute:

source: See :cpy-file:`Doc/README.rst` for more information.
pt_br: Consulte :cpy-file:`Doc/README.rst` para obter mais informações.

source: Build using Sphinx directly
pt_br: Construa usando o Sphinx diretamente

source: Advanced users may want to invoke Sphinx directly, to pass specialized options or to handle specific use cases.
pt_br: Usuários avançados podem querer invocar o Sphinx diretamente, para passar opções especializadas ou para lidar com casos de uso específicos.

source: Make sure the environment you :ref:`created above <doc-create-venv-windows>` is `activated <venv-activate_>`__. Then, install the documentation requirements, :cpy-file:`Doc/requirements.txt`. Using pip::
pt_br: Certifique-se de que o ambiente que você :ref:`criou acima <doc-create-venv-windows>` esteja `ativado <venv-activate_>`_. Em seguida, instale os requisitos d documentação, :cpy-file:`Doc/requirements.txt`. Usando pip::

source: Finally, directly invoke Sphinx with::
pt_br: Finalmente, invoque diretamente o Sphinx com::

source: To use a different `Sphinx builder`_, replace ``html`` above with the desired builder ``name``.
pt_br: Para usar um `construtor Sphinx`_ diferente, substitua o html acima pelo nome (``name``) do construtor desejado.

source: Style guide
pt_br: Guia de estilo

source: Moved to :doc:`style-guide`.
pt_br: Movido para :doc:`style-guide`.

source: Translating
pt_br: Tradução

source: Moved to :doc:`translating`.
pt_br: Movido para :doc:`translating`.
