Repository: rffontenelle/devguide-pt-br
Catalog: documentation/translating.po
Languages: pt_br

source: Translating
pt_br: Tradução

source: Python documentation translations are governed by :PEP:`545`. They are built by `docsbuild-scripts <https://github.com/python/docsbuild-scripts/>`__ and hosted on docs.python.org. There are several documentation translations already in production; others are works in progress.
pt_br: As traduções da documentação do Python são regidas pela :PEP:`545`. Eles são construídas por `docsbuild-scripts <https://github.com/python/docsbuild-scripts/>`__ e hospedados em docs.python.org. Existem várias traduções de documentação já em produção; outros são obras em andamento.

source: Language
pt_br: Idioma

source: Contact
pt_br: Contato

source: Arabic (ar)
pt_br: Árabe (ar)

source: Bengali as spoken in India (bn_IN)
pt_br: Bengali como falado na Índia (bn_IN)

source: French (fr)
pt_br: Francês (fr)

source: Hindi as spoken in India (hi_IN)
pt_br: Hindi conforme falado na Índia (hi_IN)

source: Hungarian (hu)
pt_br: Húngaro (hu)

source: `GitHub <github_hu_>`_ `Mailing List <list_hu_>`_
pt_br: `GitHub <github_hu_>`_ `Lista de discussão <list_hu_>`_

source: Indonesian (id)
pt_br: Indonésio (id)

source: Italian (it)
pt_br: Itália (it)

source: `mail <mail_it_>`_
pt_br: `correio <mail_it_>`_

source: Japanese (ja)
pt_br: Japonês (ja)

source: Lithuanian (lt)
pt_br: Lituano (lt)

source: `mail <mail_lt_>`_
pt_br: `correio <mail_lt_>`_

source: Persian (fa)
pt_br: Persa (fa)

source: Polish (pl)
pt_br: Polonês (pl)

source: `GitHub <github_pl_>`_ `Translations <tx_pl_>`_ `Doc <doc_pl_>`_ `mail <mail_pl_>`_
pt_br: `GitHub <github_pl_>`_ `Traduções <tx_pl_>`_ `Doc <doc_pl_>`_ `correio <mail_pl_>`_

source: Portuguese (pt)
pt_br: Português (pt)

source: Portuguese as spoken in Brasil (pt-br)
pt_br: Português como falado no Brasil (pt-br)

source: `GitHub <github_pt_br_>`_ `Wiki <wiki_pt_br_>`_ `Telegram <chat_pt_br_>`_ `article <article_pt_br_>`_
pt_br: `GitHub <github_pt_br_>`_ `Wiki <wiki_pt_br_>`_ `Telegram <chat_pt_br_>`_ `artigo <article_pt_br_>`_

source: Russian (ru)
pt_br: Russo (ru)

source: `mail <mail_ru_>`_
pt_br: `correio <mail_ru_>`_

source: Simplified Chinese (zh-cn)
pt_br: Chinês simplificado (zh-cn)

source: Spanish (es)
pt_br: Espanhol (es)

source: Traditional Chinese (zh-tw)
pt_br: Chinês tradicional (zh-tw)

source: Turkish (tr)
pt_br: Turco (tr)

source: Ukrainian (uk)
pt_br: Ucraniano (uk)

source: `GitHub <github_uk_>`_ `Translations <tx_uk_>`_
pt_br: `GitHub <github_uk_>`_ `Traduções <tx_uk_>`_

source: Starting a new translation
pt_br: Iniciando uma nova tradução

source: First subscribe to the `translation mailing list <translation_ml_>`_, and introduce yourself and the translation you're starting. Translations fall under the aegis of the `PSF Translation Workgroup <translation_wg_>`_
pt_br: Primeiro, inscreva-se na `lista de discussão de tradução <translation_ml_>`_ e apresente-se e apresente a tradução que está iniciando. As traduções estão sob a égide do `PSF Translation Workgroup <translation_wg_>`_

source: Then you can bootstrap your new translation by using our `cookiecutter <https://github.com/JulienPalard/python-docs-cookiecutter>`__.
pt_br: Então você pode inicializar sua nova tradução usando nosso `cookiecutter <https://github.com/JulienPalard/python-docs-cookiecutter>`__.

source: The important steps look like this:
pt_br: As etapas importantes são assim:

source: Create the GitHub repo (anywhere) with the right hierarchy (using the cookiecutter).
pt_br: Crie o repositório GitHub (em qualquer lugar) com a hierarquia correta (usando o cookiecutter).

source: Gather people to help you translate. You can't do it alone.
pt_br: Reúna pessoas para ajudá-lo a traduzir. Você não pode fazer isso sozinho.

source: Ensure we update this page to reflect your work and progress, either via a PR or by asking on the `translation mailing list <translation_ml_>`_.
pt_br: Certifique-se de atualizar esta página para refletir seu trabalho e progresso, seja por meio de um PR ou pedindo na `lista de discussão de tradução <translation_ml_>`_.

source: When ``bugs.html``, ``tutorial``, and ``library/functions`` are 100% completed, ask on the `translation mailing list <translation_ml_>`_ for your language to be added in the language picker on docs.python.org.
pt_br: Quando ``bugs.html``, ``tutorial`` e ``library/functions`` estiverem 100% concluídos, pergunte na `lista de discussão de tradução <translation_ml_>`_ para adicionar seu idioma ao seletor de idiomas em docs.python.org.

source: PEP 545 summary
pt_br: Resumo da PEP 545

source: Here are the essential points of :PEP:`545`:
pt_br: Aqui estão os pontos essenciais da :PEP:`545`:

source: Each translation is assigned an appropriate lowercased language tag, with an optional region subtag, and joined with a dash, like ``pt-br`` or ``fr``.
pt_br: Cada tradução recebe uma tag de idioma em minúsculas apropriada, com uma subtag de região opcional e unida com um traço, como ``pt-br`` ou ``fr``.

source: Each translation is under CC0 and marked as such in the README (as in the cookiecutter).
pt_br: Cada tradução está em CC0 e marcada como tal no README (como no cookiecutter).

source: Translation files are hosted on ``https://github.com/python/python-docs-{LANGUAGE_TAG}`` (not mandatory to start a translation, but mandatory to land on ``docs.python.org``).
pt_br: Os arquivos de tradução estão hospedados em ``https://github.com/python/python-docs-{TAG_IDIOMA}`` (não obrigatório para iniciar uma tradução, mas obrigatório para acessar ``docs.python.org``).

source: Translations having completed ``tutorial/``, ``library/stdtypes`` and ``library/functions`` are hosted on ``https://docs.python.org/{LANGUAGE_TAG}/{VERSION_TAG}/``.
pt_br: As traduções concluídas em ``tutorial/``, ``library/stdtypes`` e ``library/functions`` são hospedadas em ``https://docs.python.org/{TAG_IDIOMA}/{TAG_VERSÃO}/``.

source: How to get help
pt_br: Como obter ajuda

source: Discussions about translations occur on the `translation mailing list <translation_ml_>`_, and there's a `Libera.Chat IRC <https://libera.chat/>`_ channel, ``#python-doc``.
pt_br: Discussões sobre traduções ocorrem na `lista de discussão de tradução <translation_ml_>`_, e há o canal ``#python-doc`` no `IRC do Libera.Chat <https://libera.chat/>`_.

source: Translation FAQ
pt_br: FAQ de tradução

source: Which version of the Python documentation should be translated?
pt_br: Qual versão da documentação do Python deve ser traduzida?

source: Consensus is to work on current stable. You can then propagate your translation from one branch to another using `pomerge <https://pypi.org/project/pomerge/>`__.
pt_br: O consenso é trabalhar no atual estável. Você pode então propagar sua tradução de um branch para outro usando `pomerge <https://pypi.org/project/pomerge/>`__.

source: Are there some tools to help in managing the repo?
pt_br: Existem algumas ferramentas para ajudar na gestão do repo?

source: Here's what we're using:
pt_br: Aqui está o que estamos usando:

source: `pomerge <https://pypi.org/project/pomerge/>`__ to propagate translations from one file to others.
pt_br: `pomerge <https://pypi.org/project/pomerge/>`__ para propagar traduções de um arquivo para outros.

source: `pospell <https://pypi.org/project/pospell/>`__ to check for typos in ``.po`` files.
pt_br: `pospell <https://pypi.org/project/pospell/>`__ para verificar erros de digitação em arquivos ``.po``.

source: `potodo <https://pypi.org/project/potodo/>`__ to list what needs to be translated.
pt_br: `potodo <https://pypi.org/project/potodo/>`__ para listar o que precisa ser traduzido.

source: How is a coordinator elected?
pt_br: Como é eleito um coordenador?

source: There is no election; each translation has to sort this out. Here are some suggestions.
pt_br: Não há eleição; cada tradução tem que resolver isso. Aqui estão algumas sugestões.

source: Coordinator requests are to be public on the `translation mailing list <translation_ml_>`_.
pt_br: As solicitações do coordenador devem ser públicas na `lista de discussões de tradução <translation_ml_>`_.

source: If the given language has a native core dev, the core dev has their say on the choice.
pt_br: Se o idioma fornecido tiver um desenvolvedor principal nativo, o desenvolvedor principal terá uma palavra a dizer sobre a escolha.

source: Anyone who wants to become coordinator for their native language and shows motivation by translating and building a community will be named coordinator.
pt_br: Qualquer pessoa que queira se tornar coordenadora de seu idioma nativo e demonstre motivação traduzindo e construindo uma comunidade será nomeada coordenadora.

source: In case of concurrency between two persons, no one will sort this out for you. It is up to you two to organize a local election or whatever is needed to sort this out.
pt_br: Em caso de concorrência entre duas pessoas, ninguém resolverá isso para você. Cabe a vocês dois organizar uma eleição local ou o que for necessário para resolver isso.

source: If a coordinator becomes inactive or unreachable for a long period of time, someone else can ask for a takeover on the `translation mailing list <translation_ml_>`_.
pt_br: Se um coordenador ficar inativo ou inacessível por um longo período de tempo, outra pessoa pode solicitar uma aquisição na `lista de discussão de tradução <translation_ml_>`_.

source: The entry for my translation is missing/not up to date on this page
pt_br: A entrada para minha tradução está faltando/desatualizada nesta página

source: Ask on the `translation mailing list <translation_ml_>`_, or better, make a PR on the `devguide <https://github.com/python/devguide/>`__.
pt_br: Peça na `lista de discussão de tradução <translation_ml_>`_, ou melhor, faça um PR no `devguide <https://github.com/python/devguide/>`__.

source: You can ask for help on the `translation mailing list <translation_ml_>`_, and the team will help you create an appropriate repository. You can still use tools like transifex, if you like.
pt_br: Você pode pedir ajuda na `lista de discussão de tradução <translation_ml_>`_, e a equipe irá ajudá-lo a criar um repositório apropriado. Você ainda pode usar ferramentas como Transifex, se quiser.

source: No, inside the ``github.com/python`` organization we’ll all have the exact same hierarchy so bots will be able to build all of our translations. So you may have to convert from one hierarchy to another. Ask for help on the `translation mailing list <translation_ml_>`_ if you’re not sure on how to do it.
pt_br: Não, dentro da organização ``github.com/python`` todos nós teremos exatamente a mesma hierarquia para que os bots possam construir todas as nossas traduções. Então você pode ter que converter de uma hierarquia para outra. Peça ajuda na `lista de discussão de tradução <translation_ml_>`_ se não tiver certeza de como fazê-lo.

source: What hierarchy should I use in my GitHub repository?
pt_br: Qual hierarquia devo usar no meu repositório GitHub?

source: As for every project, we have a *branch* per version. We store ``.po`` files in the root of the repository using the ``gettext_compact=0`` style.
pt_br: Como em todo projeto, temos um *branch* por versão. Armazenamos arquivos ``.po`` na raiz do repositório usando o estilo ``gettext_compact=0``.
